Repository: SkyTemple/skytemple-randomizer
Catalog: skytemple_randomizer/data/locale/*/LC_MESSAGES/org.skytemple.Randomizer.po
Languages: ja_jp, ru_ru

source: English
ja_jp: 英語
ru_ru: Английский

source: Debug Strings (Game Init)
ja_jp: デバッグ文字列 (ゲーム開始時)
ru_ru: Отладочные строки (инициализация игры)

source: Chapter and Special Episode Strings
ja_jp: チャプター・スペシャルエピソード文字列
ru_ru: Строки глав и особых эпизодов

source: Explorer Ranks Names
ja_jp: たんけんたいランクの名称
ru_ru: Названия рангов исследователя

source: Default Menu Strings 1
ja_jp: デフォルトメニュー文字列1

source: Default Menu Strings 2
ja_jp: デフォルトメニュー文字列2

source: Debug Strings (Main Menu)
ja_jp: デバッグ文字列 (メインメニュー)
ru_ru: Отладочные строки (Главное меню)

source: Default Team Names
ja_jp: デフォルトのチーム名
ru_ru: Названия команд по умолчанию

source: Save Data Strings
ja_jp: セーブデータ文字列
ru_ru: Строки сохранения данных

source: Gummi Feedback
ja_jp: グミを食べた時のメッセージ
ru_ru: Отзывы о жевательной резинке

source: Kangaskhan Storage Filter Strings
ja_jp: ガルーラのそうこ フィルター文字列
ru_ru: Строки фильтрации хранилища Кангасхан

source: Kangaskhan Storage Strings
ja_jp: ガルーラのそうこ関連文字列
ru_ru: Строки хранилища Кангасхан

source: Kecleon Market Strings
ja_jp: カクレオンしょうてん関連文字列
ru_ru: Строки рынка Кеклеона

source: Duskull Bank Strings
ja_jp: ヨマワルぎんこう関連文字列
ru_ru: Строки банка Даскалла

source: Personality Quiz Questions
ja_jp: 性格診断の質問
ru_ru: Вопросы теста на характер

source: Personality Quiz Answers
ja_jp: 性格診断の答え
ru_ru: Ответы теста на характер

source: Sentry Duty Strings
ja_jp: みはりばん文字列
ru_ru: Строки работы стражами

source: Sentry Duty Hints
ja_jp: みはりばんヒント
ru_ru: Подсказки на работе стражами

source: Weather Change Feedback
ja_jp: てんき変化時のメッセージ
ru_ru: Отзывы об изменении погоды

source: Weather Names
ja_jp: てんき名
ru_ru: Названия погодных условий

source: Mission Failure/Faint Strings
ja_jp: 依頼失敗・敗北時の文字列
ru_ru: Строки провала миссий

source: Speed Change Feedback
ja_jp: 移動速度変化時のメッセージ
ru_ru: Отзывы об изменении скорости

source: Kecleon Dungeon Shop Strings
ja_jp: カクレオン商店の文字列
ru_ru: Строки магазина Кеклеона в подземелье

source: Grab Bags Shop Strings
ja_jp: 「マルノームふくぶくろてん」の文字列
ru_ru: Строки магазина лотерейных мешочков

source: Shedinja Shop Strings
ja_jp: 「ヌケニンのあなぬけガイド」の文字列
ru_ru: Строки магазина Шединджи

source: Mime Jr. Spa Strings
ja_jp: 「マネネのいやしスペース」の文字列
ru_ru: Строки спа Майма Джуниора

source: Swalot's Shop Strings
ja_jp: 「ベロベルトランドリー」の文字列
ru_ru: Строки магазина Свалота

source: Pokemon LEVEL_UP Dialogue
ja_jp: レベルアップした時の台詞
ru_ru: Реплики повышения уровня покемонов

source: Pokemon WAIT Dialogue
ja_jp: 待機時の台詞
ru_ru: Реплики ожидания покемонов

source: Pokemon HEALTHY Dialogue
ja_jp: 残りHP80%の時の台詞
ru_ru: Реплики здоровых покемонов

source: Pokemon HALF_LIFE Dialogue
ja_jp: 残りHP50%の時の台詞
ru_ru: Реплики раненых покемонов

source: Pokemon PINCH Dialogue
ja_jp: 残りHP25%の時の台詞
ru_ru: Реплики сильно раненых покемонов

source: Pokemon GROUND_WAIT Dialogue
ja_jp: 待機時の台詞 (グラウンド)
ru_ru: Реплики ожидания покемонов в подземелье

source: Item Names
ja_jp: どうぐ名
ru_ru: Названия предметов

source: Move Names
ja_jp: わざ名
ru_ru: Названия навыков

source: Pokemon Names
ja_jp: ポケモン名
ru_ru: Имена покемонов

source: Pokemon Categories
ja_jp: ポケモンの分類
ru_ru: Категории покемонов

source: Tactics Names
ja_jp: さくせん名
ru_ru: Названия тактик

source: Tactics Descriptions
ja_jp: さくせんの説明
ru_ru: Описания тактик

source: IQ Skills Names
ja_jp: かしこさ名
ru_ru: Названия IQ-навыков

source: IQ Skills Descriptions
ja_jp: かしこさの説明
ru_ru: Описания IQ-навыков

source: Move Targets Strings
ja_jp: わざの対象の文字列
ru_ru: Строки целей навыков

source: Accuracy/Power Stars Ratings
ja_jp: めいちゅう/いりょくの星のレート

source: Move Descriptions
ja_jp: わざの説明
ru_ru: Описание приемов

source: Item Long Descriptions
ja_jp: どうぐの長い説明
ru_ru: Подробное описание предмета

source: Item Short Descriptions
ja_jp: どうぐの短い説明
ru_ru: Краткое описание предмета

source: Trap Names
ja_jp: わな名
ru_ru: Названия ловушек

source: Trap Descriptions
ja_jp: わなの説明
ru_ru: Описание ловушек

source: Type Names
ja_jp: タイプ名
ru_ru: Названия типов

source: Ability Names
ja_jp: とくせい名
ru_ru: Названия способностей

source: Ability Descriptions
ja_jp: とくせいの説明
ru_ru: Описания способностей

source: Portrait Names
ja_jp: ポートレート名
ru_ru: Названия портретов

source: Ground Map Names
ja_jp: グラウンドマップ名

source: Dungeon Names (Main)
ja_jp: ダンジョン名 (メイン)

source: Dungeon Names (Selection)
ja_jp: ダンジョン名 (選択)

source: Dungeon Names (SetDungeonBanner)
ja_jp: ダンジョン名 (ダンジョン内)

source: Dungeon Names (Banner)
ja_jp: ダンジョン名 (バナー)

source: Spinda's Juice Bar Strings
ja_jp: 「パッチールのドリンクスタンド」の文字列

source: Recycle Shop Strings
ja_jp: 「たんけんリサイクル」の文字列

source: Thrown - Pierce
ja_jp: 投擲物 (とげ)

source: Thrown - Rock
ja_jp: 投擲物 (石)

source: Berries, Seeds, Vitamins
ja_jp: きのみ・タネ・栄養ドリンク
ru_ru: Ягоды, семена, витамины

source: Foods, Gummies
ja_jp: 食料・グミ
ru_ru: Еда, жевательные резинки

source: Hold
ja_jp: 装備品

source: TMs, HMs
ja_jp: わざマシン
ru_ru: TM, HM

source: Poké (Money)
ja_jp: ポケ (お金)
ru_ru: Поке (Деньги)

source: Unknown 7
ja_jp: 不明 7
ru_ru: Неизвестно 7

source: Other
ja_jp: その他
ru_ru: Прочее

source: Orbs
ja_jp: ふしぎだま
ru_ru: Орбы

source: Link Box
ja_jp: れんけつばこ

source: Used TM
ja_jp: しようごマシン
ru_ru: Использованный TM

source: Treasure Box 1
ja_jp: 宝箱1

source: Treasure Box 2
ja_jp: 宝箱2

source: Treasure Box 3
ja_jp: 宝箱3

source: Exclusive Items
ja_jp: 専用道具
ru_ru: Эксклюзивные предметы

source: Red component
ja_jp: R値
ru_ru: Красный компонент

source: Green component
ja_jp: G値
ru_ru: Зеленый компонент

source: Blue component
ja_jp: B値
ru_ru: Синий компонент

source: Alpha component
ja_jp: アルファ値
ru_ru: Компонент альфа-канала

source: Conversion 2 Type when hit by a Fairy move
ja_jp: フェアリータイプの技が命中した時のタイプ変換先

source: ID of the first icon in markfont.dat (23 entries used)
ja_jp: markfont.dat内の最初のアイコンID (うち23エントリが使用済)

source: Display accuracy and power values
ja_jp: 命中率と威力の値を表示

source: ID of the first icon in markfont.dat (24 entries used)
ja_jp: markfont.dat内の最初のアイコンID (うち24エントリが使用済)

source: String ID for push dialogue
ja_jp: プッシュダイアログの文字列ID

source: String mentioned above is replaced by a default text when applying
ja_jp: 上記の文字列は、適用時にデフォルトのテキストに置き換えられます

source: Only interruptions don't heal HP
ja_jp: HPを回復せずに中断
ru_ru: Только прерывания не восстанавливают ОЗ

source: % of exp. shared
ja_jp: Expのシェア率

source: String ID for the Menu Option
ja_jp: メニューオプションの文字列 ID
ru_ru: ID строк опций меню

source: String ID to confirm the appraise all
ja_jp: 「すべてかんてい」時に確認する時の文字列ID
ru_ru: ID строк подтверждения оценки всех предметов

source: String ID before revealing the items
ja_jp: アイテム公開前の文字列 ID
ru_ru: ID строк до раскрытия предметов

source: String ID when revealing an item
ja_jp: アイテムを公開するときの文字列 ID
ru_ru: ID строк раскрытия предмета

source: All strings mentioned above are replaced by a default text when applying
ja_jp: 上記のすべての文字列は適用時にデフォルトテキストに置き換えられます
ru_ru: Все вышеупомянутые строки при применении заменяются текстом по умолчанию

source: Cost of each Treasure Box (Only for Appraise All option)
ja_jp: 各宝箱のコスト (「すべて鑑定」オプションのみ)
ru_ru: Стоимость каждого ящика с сокровищами (Только для опции "Оценить всё")

source: Update the level and stats of evolved enemies
ja_jp: 進化した敵のレベルと統計を更新
ru_ru: Обновлять уровень и характеристики эволюционировавших врагов

source: Fully heal enemies after evolving
ja_jp: 敵が進化した後完全に回復させる
ru_ru: Полностью исцелять врагов при эволюции

source: Update the moves of evolved enemies
ja_jp: 進化した敵の技を更新
ru_ru: Обновлять навыки эволюционировавших врагов

source: Increase Atk/SpAtk/Def/SpDef of evolved enemies by
ja_jp: 進化した敵の攻撃・特攻・防御・特防を増加
ru_ru: Увеличивать Атк/Сп. Атк/Защ/Сп. Защ эволюционировавших врагов на

source: Let enemies evolve even if the defeated pokémon is revived
ja_jp: 倒されて復活した時にも敵を進化させる
ru_ru: Позволять врагав эволюционировать, если побеждённый ими покемон воскрешён

source: French
ja_jp: フランス語
ru_ru: Французский

source: German
ja_jp: ドイツ語
ru_ru: Немецкий

source: Italian
ja_jp: イタリア語
ru_ru: Итальянский

source: Spanish
ja_jp: スペイン語
ru_ru: Испанский

source: Value for macro variable {var_name} not provided.
ja_jp: マクロ変数 {var_name} の値は指定されていません。
ru_ru: Значение макропеременной {var_name} не указано.

source: No value for adventure_log set.
ja_jp: adventure_log に値が設定されていません。
ru_ru: Не указано значение для adventure_log.

source: No variable for clear.
ja_jp: 変数 clear が存在しません。
ru_ru: Не указана переменная для clear.

source: No variable for dungeon_mode set.
ja_jp: dungeon_mode に変数が設定されていません。
ru_ru: Не указана переменная для dungeon_mode set.

source: No value for dungeon_mode set.
ja_jp: dungeon_mode に値が設定されていません。
ru_ru: Не указано значение для dungeon_mode set.

source: No variable for init.
ja_jp: init に変数が定義されていません。
ru_ru: Не указана переменная для init.

source: No variable for assignment.
ja_jp: 割り当てるための変数がありません
ru_ru: Не указана переменная для assignment.

source: No operator set for assignment.
ja_jp: 割り当てるための演算子が設定されていません
ru_ru: Не указан оператор для assignment.

source: No value set for assignment.
ja_jp: 割り当て用の値が設定されていません。
ru_ru: Не указано значение для assignment.

source: value(X) can not be used with index based assignments (line {self.ctx.start.line}).
ja_jp: 値(X)はインデックスベースの割り当て( {self.ctx.start.line}行)では使用できません.
ru_ru: value(X) нельзя использовать с присваиваниями, основанными на индексе (строка {self.ctx.start.line}).

source: No target for reset.
ja_jp: リセットの対象が存在していません。
ru_ru: Не указана цель для reset.

source: No variable for assignment set.
ja_jp: 代入セット用の変数がありません。
ru_ru: Не указана переменная для присваивания.

source: scn() without a variable.
ja_jp: scn() 変数がありません。
ru_ru: scn() без переменной.

source: value() without a variable.
ja_jp: value() 変数がありません。
ru_ru: value() без переменной.

source: No target ID set for with(){} block.
ja_jp: With(){} ブロックにターゲット ID が設定されていません。
ru_ru: Не указан ID цели для блока with(){}.

source: A with(){} block needs exactly one statement.
ja_jp: With(){} ブロックには、1つのステートメントが必要です。

source: Invalid with(){{}} target type '{for_type}'.
ja_jp: 無効 with(){{}} ターゲットタイプ '{for_type}'.
ru_ru: Неверный целевой тип '{for_type}' блока with(){{}}.

source: A with(){} block needs exactly one binary operation. The handler for it generated multiple operations.
ja_jp: With(){} ブロックは、1つのバイナリ演算を必要とします。ハンドラは複数の演算を生成します。

source: A with(){} block can not contain labels.
ja_jp: with(){} ブロックにラベルを含めることはできません。
ru_ru: Блок with(){} не может содержать метки.

source: No variable in if condition.
ja_jp: if 条件に値が設定されていません。
ru_ru: В if-условии нет переменной.

source: The variable {var_target_name} can not be used with 'not' (line {self.ctx.start.line}).
ja_jp: 変数 {var_target_name} は 'not' と一緒に使用することはできません ( {self.ctx.start.line}行目)。
ru_ru: Переменная {var_target_name} не может быть использована с 'not' (строка {self.ctx.start.line}).

source: No variable for if condition.
ja_jp: If 条件の変数がありません。
ru_ru: В if-условии нет переменной.

source: No operator set for if condition.
ja_jp: if条件に演算子が設定されていません。
ru_ru: Для if-условия не назначен оператор.

source: No value set for if condition.
ja_jp: if 条件に値が設定されていません。
ru_ru: Для if-условия не указано значение.

source: The only supported operators for scn if conditions are ==,<,<=,>,>= (line {self.ctx.start.line})
ja_jp: Scn if 条件でサポートされる演算子は ==、<、<=、>、>= だけです ( {self.ctx.start.line}行目)
ru_ru: В scn if-условии допустимы лишь операторы ==,<,<=,>,>= (строка {self.ctx.start.line})

source: Invalid content for an if-header
ja_jp: If-header のコンテンツが無効です
ru_ru: Неверное содержимое if-заголовка

source: Invalid operation for if condition: {op.op_code.name} (line {self.ctx.start.line})
ja_jp: If 条件: {op.op_code.name} ( {self.ctx.start.line}行目) の操作は無効です
ru_ru: Неверная операция для if-условия: {op.op_code.name} (строка {self.ctx.start.line})

source: Unknown if operation in line {self.ctx.start.line}).
ja_jp: {self.ctx.start.line} 行での操作が不明です)。
ru_ru: Неивестная операция if в строке {self.ctx.start.line}.

source: Invalid message switch case call.
ja_jp: 無効なメッセージスイッチのケースコール。
ru_ru: Неверный вызов case switch-сообщения.

source: Unknown case operation.
ja_jp: 不明なケース操作です。
ru_ru: Неверная операция case.

source: Invalid message switch.
ja_jp: 無効なメッセージスイッチです。
ru_ru: Неверное switch-сообщение.

source: A message_ switch can only contain cases with strings (line {self.ctx.start.line}).
ja_jp: Message_switchは文字列( {self.ctx.start.line}行)の場合のみ使用できます。
ru_ru: switch-сообщение может сожержать лишь case-ы со строками (строка {self.ctx.start.line}).

source: Invalid case type for message_ switch (line {self.ctx.start.line}).
ja_jp: Message_ switch ({self.ctx.start.line}行目) のケースタイプが無効です。
ru_ru: Неверный тип case для switch-сообщения (строка {self.ctx.start.line}).

source: A switch block can only have a single default case (line {self.ctx.start.line}
ja_jp: スイッチブロックにはデフォルトケースを 1 つだけ指定できます ({self.ctx.start.line}行目
ru_ru: Блок switch может содержать лишь один default-case (строка {self.ctx.start.line})

source: A switch case must contain a list of statements (line {self.ctx.start.line}).
ja_jp: Switch caseにはステートメントのリストが含まれている必要があります ( {self.ctx.start.line}行目)。
ru_ru: В case switch-сообщения должен быть список выражений (строка {self.ctx.start.line}).

source: Unexpected switch end (line {self.ctx.start.line})
ja_jp: 予期しないswitch終了 ( {self.ctx.start.line}行目)
ru_ru: Неожиданное окончание switch(строка {self.ctx.start.line})

source: A switch block can only have a single default case (line {self.ctx.start.line}).
ja_jp: Switchブロックには、デフォルトケースを 1 つだけ指定できます ( {self.ctx.start.line}行目)。
ru_ru: Блок switch может иметь только один default (строка {self.ctx.start.line}).

source: Invalid content for a switch-header
ja_jp: Switch-headerの内容が無効です
ru_ru: Неверное содержимое switch-заголовка

source: Unknown switch operation.
ja_jp: 不明なswitch操作。

source: No dungeon id set for dungeon_mode switch condition.
ja_jp: Dungeon_mode 切り替え条件に dungeon id が設定されていません。

source: No value set for random switch condition.
ja_jp: Random switch条件には値が設定されていません。
ru_ru: Для случайного switch-условия не установлено значение.

source: No variable set for scn switch condition.
ja_jp: Scn switch条件の変数が設定されていません。

source: Index for scn() if condition must be 0 or 1 (line {self.ctx.start.line}).
ja_jp: 条件が 0 または 1 でなければならない場合の scn() のインデックス ({self.ctx.start.line} 行目)。

source: Macro {name} not found.
ja_jp: マクロ {name} が見つかりません。
ru_ru: Макро {name} не найден.

source: Dependency cycle detected while trying to resolve macros (for macro '{v['name']}').
ja_jp: マクロを解決しようとしているときに依存関係サイクルが検出されました (マクロ '{v['name']}') 。

source: Macros can not alias.
ja_jp: マクロにはエイリアスを付けることはできません。

source: Fatal compilation error: Unexpected compilation handler on stack.
ja_jp: 致命的なコンパイルエラー: スタック上の予期しないコンパイルハンドラ

source: Fatal compilation error: Stack error.
ja_jp: 致命的なコンパイルエラー: スタックエラー
ru_ru: Фатальная ошибка компиляции: Ошибка стека.

source: Label {label_id} does not exist, but a jump to it does (remove it).
ja_jp: ラベル {label_id} は存在しませんが、そのラベルへのジャンプが存在しています (削除してください)。
ru_ru: Ярлык {label_id} не существует, но переход к нему существует (удалите его).

source: Unexpected continue; in line {ctx.start.line}
ja_jp: 予期しない 'continue' {ctx.start.line} 行目
ru_ru: Неожиданный continue; в строке {ctx.start.line}

source: Unexpected break_loop; in line {ctx.start.line}
ja_jp: 予期しない 'break_loop' {ctx.start.line} 行目
ru_ru: Неожиданный break_loop; в строке {ctx.start.line}

source: Unexpected break; in line {ctx.start.line}
ja_jp: 予期しない 'break' {ctx.start.line} 行目
ru_ru: Неожиданный break; в строке {ctx.start.line}

source: Infinite recursion detected while trying to load an ExplorerScript file from {subfile_path}. Tried loading from: {file_name}.
ja_jp: {subfile_path} から ExplorerScript ファイルをロード中、無限再帰が検出されました。 {file_name} からロードしようとしました。
ru_ru: Обнаружена бесконечная рекурсия при попытке загрузить файл ExplorerScript из {subfile_path}. Была попытка загрузить из: {file_name}.

source: {fn}: Macro scripts must not contain any routines.
ja_jp: {fn}: マクロスクリプトにルーチンを含めることはできません。
ru_ru: {fn}: Макросы не должны содержать никаких рутин.

source: The file to import ('{import_file}') was not found.
ja_jp: インポートするファイル ('{import_file}') が見つかりません。
ru_ru: Импортируемый файл ('{import_file}') не найден.

source: Invalid import: '{import_file}'. Non absolute/relative imports must not contain relative paths.
ja_jp: インポートが無効です ('{import_file}') 。 非絶対/相対インポートには相対パスを含めないでください。

source: line {self.line}:{self.column}: {self.msg}
ja_jp: 行 {self.line}:{self.column}: {self.msg}
ru_ru: строка {self.line}:{self.column}: {self.msg}

source: Invalid tileset. Tileset has chunk dimensions of {dim}px, but only {CHUNK_DIM}px are supported.
ja_jp: 無効なタイルセットです。タイルセットは {dim}px のチャンクサイズですが、 {CHUNK_DIM}px のみサポートされています。

source: Invalid animation: Animation is only supported for palettes 10 and 11.
ja_jp: 無効なアニメーション: アニメーションに使用できるパレットはパレット10と11のみです。
ru_ru: Недопустимая анимация: анимация поддерживается только для палитр 10 и 11.

source: A required DTEF file is missing: {fn}. Please verify the DTEF package.
ja_jp: 必要なDTEFファイルがありません: {fn} DTEFパッケージを確認してください。
ru_ru: Отсутствует требуемый DTEF файл: {fn}. Пожалуйста, проверьте DTEF-пакет.

source: Can not import image "{basename}" as dungeon tileset: Must be indexed image (=using a palette)
ja_jp: 画像 "{basename}" をダンジョンタイルセットとしてインポートできません。 インデックス付きの画像である必要があります (=パレットを使用)
ru_ru: Невозможно импортировать изображение "{basename}" в качестве набора плиток подземелья: изображение должно быть индексировано (=использовать палитру)

source: Can not import image "{basename}" as dungeon tileset: Palette must contain 256 RGB colors.
ja_jp: 画像 "{basename}" をダンジョンタイルセットとしてインポートできません。 パレットには 256 色の RGB カラーが含まれている必要があります。
ru_ru: Невозможно импортировать изображение "{basename}" в качестве набора плиток подземелья: палитра должна содержать 256 RGB цветов.

source: A rule is missing in the import set
ja_jp: インポートセットにルールがありません
ru_ru: В импортируемом наборе отсутствует правило

source: One Layer (#00)
ja_jp: レイヤー1 (#00)
ru_ru: Один слой (#00)

source: One Layer (#01)
ja_jp: レイヤー1 (#01)
ru_ru: Один слой (#01)

source: One Layer (#02)
ja_jp: レイヤー1 (#02)
ru_ru: Один слой (#02)

source: One Layer (#03)
ja_jp: レイヤー1 (#03)
ru_ru: Один слой (#03)

source: One Layer (#04)
ja_jp: レイヤー1 (#04)
ru_ru: Один слой (#04)

source: Two Layers (#05)
ja_jp: レイヤー2 (#05)
ru_ru: Два слоя (#05)

source: Two Layers (#06)
ja_jp: レイヤー2 (#06)
ru_ru: Два слоя (#06)

source: Two Layers (#07)
ja_jp: レイヤー2 (#07)
ru_ru: Два слоя (#07)

source: Two Layers (#08)
ja_jp: レイヤー2 (#08)
ru_ru: Два слоя (#08)

source: Two Layers (#09)
ja_jp: レイヤー2 (#09)
ru_ru: Два слоя (#09)

source: Dungeon Tileset (#10)
ja_jp: ダンジョンタイルセット (#10)
ru_ru: Набор плиток подземелья (#10)

source: Use Fixed Room (#11)
ja_jp: 固定フロアで使用 (#11)
ru_ru: Использовать фиксированную комнату (#11)

source: This function has no description.
ja_jp: この関数には説明がありません。
ru_ru: У этой функции нет описания.

source: Down
ja_jp: 下
ru_ru: Вниз

source: Down Right
ja_jp: 右下
ru_ru: Вниз-вправо

source: Right
ja_jp: 右
ru_ru: Вправо

source: Up Right
ja_jp: 右上
ru_ru: Вверх-вправо

source: Up
ja_jp: 上
ru_ru: Вверх

source: Up Left
ja_jp: 左上
ru_ru: Вверх-влево

source: Left
ja_jp: 左
ru_ru: Влево

source: Down Left
ja_jp: 左下
ru_ru: Вниз-влево

source: This ROM is not supported by SkyTemple.
ja_jp: このROMはSkyTempleではサポートされていません。
ru_ru: Этот ROM не поддерживается SkyTemple.

source: Binary {binary.name} not found.
ja_jp: バイナリ {binary.name} が見つかりません。

source: Folder {dir_name} does not exist.
ja_jp: フォルダ {dir_name} は存在しません。
ru_ru: Папка {dir_name} не существует.

source: File {file_name} already exists in this folder.
ja_jp: ファイル {file_name} は既にこのフォルダに存在します。
ru_ru: Файл {file_name} уже существует в этой папке.

source: Folder {path} already exists.
ja_jp: フォルダ {path} は既に存在します。
ru_ru: Папка {path} уже существует.

source: Head
ja_jp: 頭部
ru_ru: Голова

source: Left Hand
ja_jp: 左手
ru_ru: Левая рука

source: Right Hand
ja_jp: 右手
ru_ru: Правая рука

source: Center
ja_jp: 中央
ru_ru: По центру

source: None
ja_jp: なし
ru_ru: Отсутствует

source: Invalid
ja_jp: 無効
ru_ru: Недопустимый

source: WAN File 0
ja_jp: WANファイル 0
ru_ru: WAN файл 0

source: WAN File 1
ja_jp: WANファイル 1
ru_ru: WAN файл 1

source: Screen
ja_jp: スクリーン
ru_ru: Экран

source: Flag Not Set
ja_jp: フラグ未設定
ru_ru: Флаг не активен

source: Flag Set
ja_jp: フラグ設定済み
ru_ru: Флаг активен

source: Scenario Equals
ja_jp: シナリオと等しい
ru_ru: Сценарий равен

source: Scenario Below or Equal
ja_jp: シナリオ以前
ru_ru: Сценарий меньше или равен

source: Scenario Greater or Equal
ja_jp: シナリオ以降
ru_ru: Сценарий больше или равен

source: Pokémon
ja_jp: ポケモン
ru_ru: Покемоны

source: Type
ja_jp: タイプ
ru_ru: Тип

source: The Pokemon may hatch holding the item.
ja_jp: このポケモンは専用道具を所持して孵化することがあります。
ru_ru: Покемон может вылупиться, держа предмет.

source: ? (Only all the Eeveelutions, and the Tyrogue line have items with this type!)
ja_jp: ？ (このタイプを持つ道具は、イーブイの進化系とバルキーの進化系にしかありません！)
ru_ru: ? (Только эволюции Иви и линия эволюции Тайрога имеют предметы с этим типом!)

source: Male
ja_jp: オス
ru_ru: Мужской

source: Female
ja_jp: メス
ru_ru: Женский

source: Genderless
ja_jp: 性別不明
ru_ru: Без пола

source: Unused
ja_jp: 未使用
ru_ru: Неиспользованный

source: Not an Evolved Form.
ja_jp: 進化しない
ru_ru: Не эволюционировавшая форма.

source: Level
ja_jp: レベル
ru_ru: Уровень

source: IQ
ja_jp: かしこさ

source: Items
ja_jp: 道具
ru_ru: Предметы

source: Recruited
ja_jp: 勧誘済み
ru_ru: Рекрутирован

source: No Main Requirement
ja_jp: 条件なし
ru_ru: Нет главного требования

source: Link Cable
ja_jp: つうしんケーブル
ru_ru: Кабель связи

source: Attack > Defense
ja_jp: こうげき > ぼうぎょ
ru_ru: Атака больше защиты

source: Attack < Defense
ja_jp: こうげき < ぼうぎょ
ru_ru: Атака меньше защиты

source: Attack = Defense
ja_jp: こうげき = ぼうぎょ
ru_ru: Атака равна защиты

source: Sun Ribbon
ja_jp: たいようのリボン
ru_ru: Солнечная лента

source: Lunar Ribbon
ja_jp: げっこうのリボン
ru_ru: Лунная лента

source: Beauty Scarf
ja_jp: うつくしスカーフ
ru_ru: Шарф красоты

source: Internal Value 0x1 = 1
ja_jp: 内部値 0x1 = 1
ru_ru: Внутреннее значение 0x1 = 1

source: Internal Value 0x1 = 0
ja_jp: 内部値 0x1 = 0
ru_ru: Внутреннее значение 0x1 = 0

source: Male (1st form)
ja_jp: オス (1つ目の姿)
ru_ru: Мужской (1-я форма)

source: Female (2nd form)
ja_jp: メス (2つ目の姿)
ru_ru: Женский (2-я форма)

source: Knows AncientPower
ja_jp: 技「げんしのちから」を習得している
ru_ru: Знает Древнюю Силу

source: Knows Rollout
ja_jp: 技「ころがる」を習得している
ru_ru: Знает Накат

source: Knows Double Hit
ja_jp: 技「ダブルアタック」を習得している
ru_ru: Знает Двойной Удар

source: Knows Mimic
ja_jp: 技「ものまね」を習得している
ru_ru: Знает Имитацию

source: Standard
ja_jp: 通常
ru_ru: Стандартные

source: Unknown
ja_jp: 不明
ru_ru: Неизвестно

source: Hovering
ja_jp: 空中
ru_ru: Парит

source: Phase Through Walls
ja_jp: 壁を通過
ru_ru: Может проходить сквозь стены

source: Lava
ja_jp: マグマ
ru_ru: Может ходить по лаве

source: Water
ja_jp: 水上
ru_ru: Может ходить по воде

source: Small
ja_jp: 小
ru_ru: Малый

source: Medium
ja_jp: 標準
ru_ru: Средний

source: Large
ja_jp: 大
ru_ru: Большой

source: Invalid XML. '{XML_STRINGS__NAME}' missing for language {xml_lang.tag}.
ja_jp: XML が無効です。言語 {xml_lang.tag} の '{XML_STRINGS__NAME}' が見つかりません。
ru_ru: Недопустимый XML. '{XML_STRINGS__NAME}' отсутствует для языка {xml_lang.tag}.

source: Invalid XML. '{XML_STRINGS__CATEGORY}' missing for language {xml_lang.tag}.
ja_jp: XML が無効です。言語 {xml_lang.tag} の '{XML_STRINGS__CATEGORY}' が見つかりません。
ru_ru: Недопустимый XML. '{XML_STRINGS__CATEGORY}' отсутствует для языка {xml_lang.tag}.

source: Invalid XML. '{XML_GENENT_EXCLUSIVE_ITEMS}' needs four item IDs.
ja_jp: XML が無効です。 '{XML_GENENT_EXCLUSIVE_ITEMS}' には 4 つの道具 ID が必要です。
ru_ru: Недопустимый XML. Для '{XML_GENENT_EXCLUSIVE_ITEMS}' требуется четыре ID предметов.

source: Invalid XML. '{a}' missing for a {b}.
ja_jp: XML が無効です。 {b} に '{a}' がありません。
ru_ru: Недопустимый XML. '{a}' отсутствует для {b}.

source: Invalid XML. '{XML_MOVESET_LEVEL_UP__LEVEL}' missing for a level up moveset entry.
ja_jp: XML が無効です。レベル習得技エントリ内に '{XML_MOVESET_LEVEL_UP__LEVEL}' が見つかりません。
