Repository: SkyTemple/skytemple-randomizer
Catalog: skytemple_randomizer/data/locale/*/LC_MESSAGES/org.skytemple.Randomizer.po
Languages: ja_jp, ru_ru

source: Add types to the type matchup table. This will replace the old matchup table by the 6th+ Gen type table, Fairy type being added to the end.
ja_jp: タイプ相性テーブルにタイプを追加します。これにより、古いタイプ相性テーブルが第6世代以降のテーブルに置き換わり、フェアリータイプが追加されます。

source: Allows recruiting the other Deoxys forms and the regis inside dungeons.
ja_jp: ダンジョン内に出現するノーマルフォルム以外のデオキシスと、レジロック、レジアイス、レジスチルを勧誘可能にします。

source: Allows the player to press A+B+X+Y during cutscenes to force the game to continue past a softlock (this can happen during cutscenes when using custom sprites or the randomizer). Does not work with crashes caused due to internal errors (such as the game running out of memory).
ja_jp: カットシーン中にA+B+X+Yを同時押しすることで、ソフトロックをスキップしてゲームを強制的に続行できるようにします。(これは、カスタムスプライトまたはランダマイザーを使用するカットシーン中に発生することがあります) 内部エラー(メモリ不足など)によってクラッシュした場合は動作しません。
ru_ru: Позволяет игроку нажимать A+B+X+Y во время сюжетных сцен, чтобы заставить игру продолжить после зависания (это может произойти во время сюжетных сцен при использовании пользовательских спрайтов или рандомайзера). Не работает при сбоях, вызванных внутренними ошибками (например, когда в игре закончилась память).

source: Appraise all
ja_jp: すべてかんてい
ru_ru: Оценить все

source: And to appraise all your items, you will pay [CS:G][gold_left:0][CR][M:S0]?
ja_jp: すべての たからばこの かんていには [CS:G][gold_left:0][CR][M:S0]かかるが いいか？
ru_ru: И для оценки всех ваших предметов, вы заплатите [CS:G][gold_left:0][CR][M:S0]?

source: And so...[K]it is revealed...[C] Within the boxes...[K] were...
ja_jp: …………。[K]でた。[C] たからばこの なかに あった どうぐは……[K]

source: ...a [me_play:1][string0]!
ja_jp: [me_play:1][string0]だ。
ru_ru: ...[me_play:1][string0]!

source: Adds an extra menu in box appraisal to appraise all boxes at once.
ja_jp: 「ネイティオかんていじょ」にて、一度にすべての宝箱を鑑定できる機能を追加します。
ru_ru: Добавляет дополнительное меню при оценке коробок, чтобы оценить все коробки сразу.

source: Infinite recursion detected in pre evolutions for md entry {i}.
ja_jp: md エントリ {i} の進化前において無限再帰が検出されました。
ru_ru: Обнаружена бесконечная рекурсия в предэволюциях для md-записи {i}.

source: One of the monsters in the pre-evolution chain of monster ${i:04} has an invalid pre evolution configured: ${pre_evo:04}. Can not apply patch.
ja_jp: ポケモン ${i:04} の進化前チェーン内のポケモンの 1 つに、${pre_evo:04}という無効な進化前ポケモンが設定されています。パッチは適用できません。
ru_ru: Один из монстров в цепочке предэволюции монстра ${i:04} имеет недопустимую конфигурацию предэволюции: ${pre_evo:04}. Невозможно применить патч.

source: Changes and adds some properties for fixed floors. Removes restrictions.
ja_jp: 固定フロアのいくつかのプロパティを変更および追加し、制限を解除します。
ru_ru: Изменяет и добавляет некоторые свойства для фиксированных комнат. Снимает ограничения.

source: Provides support for editing textbox background color.
ja_jp: テキストボックスの背景色の編集に対応させます。
ru_ru: Обеспечивает поддержку редактирования цвета фона текстового поля.

source: Then, who would you like to be?
ja_jp: この なかから キミがなりたいとおもう ポケモンを えらんでくれ
ru_ru: Тогда кем бы вы хотели стать?

source: Adds an extra menu during the personality test to choose the starter.
ja_jp: 性格診断で主人公を選択するメニューを追加します。
ru_ru: Добавляет дополнительное меню во время теста на личность для выбора стартового покемона.

source: [CS:S]Control mode set to[CR] [CS:C]automatic[CR][CS:S].[CR]
ja_jp: [CS:S]コントロールモード：[CR] [CS:C]じどう[CR][CS:S][CR]
ru_ru: [CS:S]Режим управления изменен на[CR] [CS:C]автоматический[CR][CS:S].[CR]

source: [CS:S]Control mode set to[CR] [CS:E]manual[CR][CS:S].[CR]
ja_jp: [CS:S]コントロールモード：[CR] [CS:E]マニュアル[CR][CS:S][CR]
ru_ru: [CS:S]Режим управления изменен на[CR] [CS:E]ручной[CR][CS:S].[CR]

source: Pressing start in a dungeon toggles between automatic and manual mode. In manual mode, you can control your partners on their turns. You must apply the extra code overlay made by End45 before applying this patch.
ja_jp: ダンジョン内でSTARTボタンを押すと、自動モードと手動モードを切り替えることができます。手動モードでは、仲間の行動をコントロールできます。 このパッチを適用するには、End45が作成した追加オーバーレイを適用する必要があります。

source: Optimizes the way the list of IQ skills learnt by each IQ group is stored, removing the limit of max 25 skills per group.
ja_jp: 各かしこさグループが習得できるかしこさリストの保存方法を最適化し、グループあたり最大25種類の制限を解除します。
ru_ru: Оптимизирует способ хранения списка IQ-навыков, изученных каждой IQ-группой, убирая ограничение на максимум 25 навыков на группу.

source: Disables the tip textboxes shown in dungeons at the beginning of the game.
ja_jp: ゲーム開始時にダンジョンに表示されるヒントメッセージを無効化します。
ru_ru: Отключает подсказки, отображаемые в подземельях в начале игры.

source: Disarms one-room Monster House floors, which can appear in cases like a layout generation failure. These floors will still be one giant room, but will no longer be Monster Houses.
ja_jp: レイアウト生成の失敗などの場合に現れる大部屋モンスターハウスを無効化します。これらのフロアは大部屋のままですが、モンスターハウスではなくなります。
ru_ru: Обезвреживает этажи, содержащие только Засаду Монстров, которые могут появиться в таких случаях, как сбой генерации подземелья. Эти этажи по-прежнему будут представлять собой одну огромную комнату, но больше не будут являться Засадой Монстров.

source: Implements dungeon interruptions.
ja_jp: ダンジョンの中断を実装します。
ru_ru: Реализует прерывания подземелий.

source: Allows placing special fixed room entities #124-127 (Explorer Maze enemies) in any fixed room without causing the game to crash.
ja_jp: ゲームをクラッシュさせることなく、任意の固定フロアに特別な固定フロアエンティティ #124 -127 (たんけんたいのまの敵) を配置できます。
ru_ru: Позволяет поместить особых сущностей фиксированных комнат #124-127 (враги Лабиринта Исследователей) в любую фиксированную комнату, не вызывая сбоев в игре.

source: Expand the pokemon entries allowed to 2048, and makes all the entries independent. Needs ChangeEvoSystem, ExternalizeWazaFile, ExternalizeMappaFile patches to work. It is strongly recommended to fix any dungeon error before applying this patch, and to save a backup of your ROM before applying this.
ja_jp: 許可されるポケモンのエントリを2048に拡張し、すべてのエントリを独立させます。 動作させるには、ChangeEvoSystem、ExternalizeWazaFile、ExternalizeMappaFile パッチが必要です。 このパッチを適用する前にダンジョンエラーを修正し、ROMのバックアップを保存することを強く推奨します。

source: This patch adds a new overlay 36 to the game, which is loaded at address 0x023A7080 and provides extra space for patches to place code and data in.
ja_jp: このパッチは、ゲームに新たなoverlay36を追加します。 アドレス0x023A7080でロードされ、パッチ用のコードとデータを配置するスペースとして拡張します。

source: Extracts animation data and put it in files. Needs ActorAndLevelLoader patch to free some space.
ja_jp: アニメーションデータを抽出してファイルに入れます。 スペースを解放するには ActorAndLevelLoader のパッチが必要です。

source: Extracts Spinda bar's item list.
ja_jp: パッチールのカフェの道具リストを抽出します。
ru_ru: Извлекает список предметов бара Спинды.

source: Extracts the floor ranks, forbidden mission floors, items available in dungeon tables and put them in files. Provides support for reading them from the rom file system.
ja_jp: フロアランク、依頼に使用できないフロア、ダンジョンに落ちている道具を抽出し、ファイルに入れます。ROM ファイルシステムからの読み取りをサポートします。
ru_ru: Извлекает таблицы рангов этажей, этажей на которых запрещены миссии, предметов, доступных в подземельях, и помещает их в файлы. Обеспечивает поддержку чтения из файловой системы ROM.

source: Extracts item effects code and put it in files.
ja_jp: 道具効果コードを抽出し、ファイルに入れます。
ru_ru: Извлекает код эффектов предметов и помещает его в файлы.

source: Extracts the hardcoded item lists, used for mission rewards/treasure boxes content as well as Kecleon shop items, and put them in files. Provides support for reading them from the rom file system.
ja_jp: 依頼の報酬/宝箱のコンテンツやカクレオン商店の道具に使用されるハードコードされた道具リストを抽出し、ファイルに入れます。ROM ファイルシステムからの読み取りをサポートします。
ru_ru: Извлекает списки предметов, используемые при определении вознаграждений за миссии, содержимого сундуков с сокровищами, а также содержимого магазина Кеклеона, и помещает их в файлы. Обеспечивает поддержку чтения их из файловой системы ROM.

source: Don't have enough space to put filenames!
ja_jp: ファイル名を入れるスペースが足りません。
ru_ru: Недостаточно места для размещения имен файлов!

source: Extracts move effects code and put it in files.
ja_jp: 道具効果コードを抽出し、ファイルに入れます。
ru_ru: Извлекает код эффектов приемов и помещает его в файлы.

source: Implements Fairy-type specialized gummies. Uses unused item 138. Needs ExtractItemCode, ExtractBarItemList and AddTypes patches to be applied for this patch to work. Also, you'll need to reapply this if you apply AddTypes again.
ja_jp: フェアリータイプの専用グミを追加します。未使用道具138を使用します。 このパッチを機能させるには、ExtractItemCode、ExtractBarItemList、AddTypes パッチを適用する必要があります。 また、AddTypes を再度適用する場合は、これを再度適用し直す必要があります。
ru_ru: Реализует жевательные резинки для Волшебного типа покемонов. Использует неиспользованный предмет 138. Для работы этого патча необходимо применить патчи ExtractItemCode, ExtractBarItemList и AddTypes. Кроме того, если вы снова примените AddTypes, вам нужно будет применить этот патч заново.

source: Fixes the evolution glitch that freezes the game when attempting to evolve a pokémon whose name has 10 characters.
ja_jp: 名前が10文字のポケモンを進化させようとするとゲームがフリーズするバグを修正します。
ru_ru: Исправлена ошибка эволюции, из-за которого игра зависает при попытке эволюционировать покемона, имя которого состоит из 10 символов.

source: If the game runs out of memory trying to load a sprite, a default one will be used instead, preventing the crash.
ja_jp: ゲームがスプライトを読み込もうとしてメモリ不足になった時、代わりにデフォルトのスプライトを使用しクラッシュを防ぎます。
ru_ru: Если во время игры закончится оперативная память при попытке загрузить спрайт, вместо него будет использован спрайт по умолчанию, что предотвратит сбой игры.

source: Fixes an issue that causes saving to fail on the No$GBA emulator. Warning: Causes saving to fail on the MelonDS emulator instead.
ja_jp: No$GBA エミュレータでセーブに失敗する問題を修正します。 注意: 代わりに MelonDs エミュレータで保存が失敗します。
ru_ru: Устраняет проблему, из-за которой не удавалось сохранение игры на эмуляторе No$GBA. Внимание: вместо этого, сохранения не будут удаваться на эмуляторе MelonDS.

source: Replaces the fixed move (L+A) with a move shortcut functionality like in GtI or Super (L+A/B/X/Y). The ExtraSpace patch must be applied before this one.
ja_jp: 技のショートカット (L+A) を GtI や Super (L+A/B/X/Y) のようなショートカット機能に置き換えます。このパッチを適用する前に ExtraSpace パッチを適用する必要があります。
ru_ru: Заменяет фиксированный прием (L+A) на функцию быстрый вызов приема как в GtI и Super (L+A/B/X/Y). Патч ExtraSpace должен быть применен до этого патча.

source: Makes negative enemy density values work as intended (the absolute value of the density is used, without adding a random variation).
ja_jp: 敵の密度の負の値が意図したとおりに機能するようにします。 (密度の絶対値が使用されます。ランダムな変化は加えず、固定の数値として扱われます。)
ru_ru: Заставляет отрицательные значения плотности врагов работать как положено (используется абсолютное значение плотности, без добавления случайной вариации).

source: Changes weather damage messages so they don't make the player stop running.
ja_jp: 天候によるダメージメッセージを変更し、プレイヤーの動作を停止しないようにします。
ru_ru: Изменяет сообщения об уроне от погоды, чтобы они не останавливали игрока.

source: Extracts the object table to a separate file in the ROM.
ja_jp: オブジェクトテーブルを ROM 内の別のファイルに抽出します。
ru_ru: Извлекает таблицу объектов в отдельный файл в ROM.

source: Changes implementation of idle animation to an editable table.
ja_jp: アイドルアニメーションの実装を編集可能なテーブルに変更します。

source: [string:0] pushed [string:1]!
ja_jp: [string:0]は [string:1]を おした！
ru_ru: [string:0] толкнул [string:1]!

source: Implements pushing allies in dungeons. Uses the same command style as PSMD
ja_jp: ダンジョンで仲間を押す機能を実装します。 ポケモン超不思議のダンジョンと同じコマンドを使用します。
ru_ru: Реализует подталкивание союзников в подземельях. Использует тот же стиль управления, что и в PSMD

source: Allows the partner to be of the same type as the player in the personality test.
ja_jp: 性格診断のパートナーの選択肢に主人公と同じタイプのポケモンを追加します。
ru_ru: Позволяет партнеру быть того же типа, что и игрок в тесте личности.

source: Who would you like to be?
ja_jp: この なかから キミがなりたいとおもう ポケモンを えらんでくれ
ru_ru: Кем бы вы хотели стать?

source: Skips the quiz, only leaving the gender question. Needs ChooseStarter patch to be applied.
ja_jp: 性格診断をスキップし、性別を訪ねる質問のみ残します。 パッチ ChooseStarter を適用する必要があります。
ru_ru: Пропускает тест на личность, оставляя только вопрос о поле. Требуется применение патча ChooseStarter.

source: Replaces old move stats display with bars. This patch may not be compatible if the markfont.dat file has been modified.
ja_jp: 技の能力表示を☆表示からバーに置き換えます。 markfont.dat ファイルが変更されている場合、このパッチは互換性がない場合があります。
ru_ru: Заменяет старое отображение статистик полосами. Этот патч может быть несовместим если файл markfont.dat был изменён.

source: Provide support for ATUPX containers, which use a different algorithm than PX compression. Requires the ActorAndLevelLoader, as it frees the space needed to implement this.
ja_jp: PX 圧縮とは異なるアルゴリズムを使用する ATUPX コンテナのサポートを提供します。 これを実装するのに必要なスペースを解放するため、パッチ ActorAndLevelLoader を適用する必要があります。
ru_ru: Обеспечивает поддержку контейнеров ATUPX, которые используют алгоритм, отличный от PX-сжатия. Требует ActorAndLevelLoader, так как он освобождает место, необходимое для реализации этой функции.

source: Fixes the 'unused' chance for dungeons. It now determines a chance of spawning a wall maze room in the floor.
ja_jp: ダンジョンの未使用の確率を修正します。これにより、フロアに壁の迷路部屋が出現する確率が決まるようになります。
ru_ru: Исправлен неиспользованный шанс для подземелий. Теперь он определяет шанс появления комнаты-лабиринта на этаже.

source: The patch '{name}' was not found.
ja_jp: パッチ '{name}' が見つかりません。
ru_ru: Патч '{name}' не найден.

source: The patch '{patch_name}' needs to be applied before you can apply '{name}'.
ja_jp: '{name}' を適用する前に、パッチ '{patch_name}' を適用する必要があります。
ru_ru: Перед применением '{name}' необходимо применить патч '{patch_name}'.

source: The patch '{patch_name}' needs to be applied before you can apply '{name}'. This patch could not be found.
ja_jp: '{name}' を適用する前に、パッチ '{patch_name}' を適用する必要があります。 このパッチは見つかりませんでした。
ru_ru: Перед применением '{name}' необходимо применить патч '{patch_name}'. Не удалось найти этот патч.

source: No configuration was given.
ja_jp: 設定は行われませんでした。
ru_ru: Конфигурация не была указана.

source: Missing configuration value.
ja_jp: 設定値がありません。
ru_ru: Отсутствует значение конфигурации.

source: Invalid configuration value.
ja_jp: 無効な設定値です。
ru_ru: Неправильное значение конфигурации.

source: Must be >= {}.
ja_jp: 値は {} 以上である必要があります。
ru_ru: Должен быть >= {}.

source: Must be <= {}.
ja_jp: 値は {} 以下である必要があります。
ru_ru: Должен быть <= {}.

source: config.xml missing in patch package.
ja_jp: パッチパッケージに config.xml が見つかりません。
ru_ru: config.xml отсутствует в пакете патча.

source: Syntax error in the config.xml while reading patch package.
ja_jp: パッチパッケージの読み込み中に config.xml の構文エラーが発生しました。
ru_ru: Синтаксическая ошибка в config.xml при чтении пакета патча.

source: patch.py missing in patch package.
ja_jp: パッチパッケージに patch.py が見つかりません。
ru_ru: patch.py отсутствует в пакете патча.

source: The patch.py of the patch package contains a syntax error.
ja_jp: パッチパッケージの patch.py に構文エラーがあります。
ru_ru: В файле patch.py пакета патча содержится синтаксическая ошибка.

source: The patch.py of the patch package does not contain a 'PatchHandler'.
ja_jp: パッチパッケージの patch.py に 'PatchHandler' が含まれていません。
ru_ru: В файле patch.py пакета патча отсутствует 'PatchHandler'.

source: The patch package does not contain an entry for the handler's patch name in the config.xml.
ja_jp: パッチパッケージの config.xml にハンドラーのパッチ名のエントリが含まれていません。

source: No patch for handler '{handler.name}' found in the configuration.
ja_jp: 設定にハンドラ '{handler.name}' のパッチが見つかりません。

source: Unknown or extra XML element '{}' in scene data.
ja_jp: シーンデータに不明または余分な XML 要素 '{}' があります。
ru_ru: Неизвестный или лишний элемент XML '{}' в данных сцены.

source: '{}' missing in scene data.
ja_jp: シーンデータに '{}' がありません。
ru_ru: '{}' отсутствует в данных сцены.

source: The event ID {} is out of bounds for one of the triggers.
ja_jp: イベント ID {} は、いずれかのトリガーの範囲外です。
ru_ru: ID события {} находится вне границ для одного из триггеров.

source: Unknown direction value.
ja_jp: 方向値が不明です。
ru_ru: Неизвестное значение направления.

source: Can not save a scene event without a defined triggered script.
ja_jp: シーンイベントを保存するには、定義済みのトリガースクリプトが必要です。

source: Invalid DungeonMode: {string}
ja_jp: ダンジョンモードが無効です: {string}
ru_ru: Неверный режим подземелья: {string}

source: Unknown constant {constant_as_string}.
ja_jp: 不明な定数 {constant_as_string}。
ru_ru: Неизвестная константа {constant_as_string}.

source: The routine data lists for the decompiler must have the same lengths.
ja_jp: 逆コンパイラのルーチンデータリストは同じ長さである必要があります。
ru_ru: Списки данных рутин для декомпилятора должны иметь одинаковую длину.

source: Routine {i} not found.
ja_jp: ルーチン {i} が見つかりません。
ru_ru: Рутина {i} не найдена.

source: The script must contain exactly {len(self.rom_data.script_data.common_routine_info)} coroutines.
ja_jp: スクリプトには {len(self.rom_data.script_data.common_routine_info)} 個のコルーチンを含まれていなければなりません。
ru_ru: Скрипт должен содержать ровно {len(self.rom_data.script_data.common_routine_info)} сопрограмм.

source: The script must not contain any duplicate coroutines.
ja_jp: スクリプトに重複するコルーチンを含めることはできません。
ru_ru: Скрипт не должен содержать повторяющихся корутин.

source: Unknown coroutine {err}
ja_jp: 不明なコルーチン {err}
ru_ru: Неизвестная корутина {err}

source: Unknown operation {in_op.op_code.name}.
ja_jp: 不明な操作 ({in_op.op_code.name}) です。
ru_ru: Неизвестная операция {in_op.op_code.name}.

source: Unknown language for string: {lang}
ja_jp: 文字列の言語 {lang} が不明です。
ru_ru: Неизвестный язык для строки: {lang}

source: Invalid parameter supplied for an operation: {param}
ja_jp: 無効なパラメータ {param} が設定されています。
ru_ru: Указан неверный параметр для операции: {param}

source: SMDL file too short (EOC EOF).
ja_jp: SMDLファイルの長さが短すぎます (EOC EOF)。

source: Invalid SMDL/EOC header.
ja_jp: SMDL/EOC ヘッダーが無効です。

source: SMDL file too short (Header EOF).
ja_jp: SMDL ファイルの長さが短すぎます (Header EOF)。

source: Invalid SMDL/Header header.
ja_jp: SMDL/Header ヘッダーが無効です。

source: SMDL file too short (Song EOF).
ja_jp: SMDLファイルの長さが短すぎます (Song EOF)。

source: Invalid SMDL/Song header.
ja_jp: SMDL/Song ヘッダーが無効です。

source: SMDL file too short (Track EOF).
ja_jp: SMDLファイルの長さが短すぎます (Track EOF)。

source: Invalid SMDL/Track header.
ja_jp: SMDL/Track ヘッダーが無効です。

source: SWDL file too short (Keygroup EOF).
ja_jp: SWDL ファイルの長さが短すぎます (Keygroup EOF)。

source: SWDL file too short (Kgrp EOF).
ja_jp: SWDLファイルの長さが短すぎます (Kgrp EOF)。

source: Invalid SWDL/Kgrp header.
ja_jp: SWDL/Kgrp ヘッダーが無効です。

source: SWDL file too short (Pcmd EOF).
ja_jp: SWDLファイルの長さが短すぎます (Pcmd EOF)。

source: Invalid SWDL/Pcmd header.
ja_jp: SWDL/Pcmd ヘッダーが無効です。

source: SWDL file too short (LFO EOF).
ja_jp: SWDLファイルの長さが短すぎます (LFO EOF)。

source: SWDL file too short (Split EOF).
ja_jp: SWDLファイルの長さが短すぎます (Split EOF)。

source: SWDL file: Invalid lowkey duplicate (Split EOF).
ja_jp: SWDL ファイル: 無効なローキー重複 (Split EOF)。

source: SWDL file: Invalid hikey duplicate (Split EOF).
ja_jp: SWDL ファイル: 無効なハイキー重複 (Split EOF)。

source: SWDL file: Invalid lolevel duplicate (Split EOF).
ja_jp: SWDL ファイル: 無効なローレベル重複 (Split EOF)。

source: SWDL file: Invalid hilevel duplicate (Split EOF).
ja_jp: SWDL ファイル: 無効なハイレベル重複 (Split EOF)。

source: SWDL file too short (PRG EOF).
ja_jp: SWDLファイルの長さが短すぎます (PRG EOF)。

source: SWDL file too short (Prgi EOF).
ja_jp: SWDLファイルの長さが短すぎます (Prgi EOF)。

source: Invalid PRGI/Prgi header.
ja_jp: PRGI/Prgi ヘッダーが無効です。

source: SWDL Prgi length invalid; tried to read past EOF.
ja_jp: SWDL Prgi の長さが無効です。読み込み時にEOFを超えています。

source: SWDL file too short (SwdlPcmdLen EOF).
ja_jp: SWDL ファイルの長さが短すぎます (SwdlPcmdLen EOF)。

source: SWDL file too short (Header EOF).
ja_jp: SWDL ファイルの長さが短すぎます (Header EOF)。

source: Invalid SWDL/Header header.
ja_jp: SWDL/Header ヘッダーが無効です。

source: Swdl read error (inconsistent Wavi length)
ja_jp: Swdl 読み込みエラー (Wavi 長さ不一致)

source: Swdl read: Invalid sample data
ja_jp: Swdl 読み込み: 無効なサンプルデータ

source: SWDL file too short (Sample Table EOF).
ja_jp: SWDL ファイルの長さが短すぎます (Sample Table EOF)。

source: SWDL file too short (Wavi EOF).
ja_jp: SWDLファイルの長さが短すぎます (Wavi EOF)。

source: Invalid SWDL/Wavi header.
ja_jp: SWDL/Wavi ヘッダーが無効です。

source: SWDL Wavi length invalid; tried to read past EOF.
ja_jp: SWDL Wavi の長さが無効です。読み込み時にEOFを超えています。

source: An image selected to import is too complex. It has too many unique tiles ({}, max allowed are 1024). Try to have less unique tiles. Unique tiles are 8x8 sections of the images that can't be found anywhere else in the image (including flipped or with a different sub-palette).
ja_jp: インポートした画像が複雑すぎます。ユニークタイルが多すぎます ({}、最大 1024) 。 ユニークタイルを少なくしてください。ユニークタイルとは、画像の 8 x 8 のセクションで、画像内の他の場所に存在しないタイルのことです (反転したタイルや、別のサブパレットを使ったタイルを含む) 。
ru_ru: Изображение, выбранное для импорта, слишком сложное. В нем слишком много уникальных плиток ({}, максимально допустимое количество — 1024). Постарайтесь, чтобы уникальных плиток было меньше. Уникальные плитки — это фрагменты изображений размером 8x8, которые больше нигде не встречаются на изображении (в том числе в перевернутом виде или в другой субпалитре).

source: The image you provided is not an indexed image (it has no palette). Please convert it to an indexed image (with a maximum of {} colors) and try again.
ja_jp: 入力された画像はインデックス付き画像ではありません (パレットはありません)。インデックス付きの画像 (最大 {} 色) に変換して、もう一度試してください。
ru_ru: Предоставленное вами изображение не является индексированным (в нем нет палитры). Пожалуйста, преобразуйте его в индексированное изображение (содержащее не более {} цветов) и попробуйте снова.

source: ROM Header checksum does not match contents.
ja_jp: ROMヘッダチェックサムが内容と一致しません。

source: Error reading the filesystem from ROM: {}
ja_jp: ROM からのファイルシステムの読み取り中にエラーが発生しました。 {}
ru_ru: Ошибка чтения файловой системы из ROM: {}

source: Can not import map background: Width of both images must match the current map width: {}px
ja_jp: マップの背景をインポートできません。 両方の画像の幅は現在のマップの幅 ({} px) と一致する必要があります。
ru_ru: Невозможно импортировать фон карты: Ширина обоих изображений должна соответствовать текущей ширине карты: {}px

source: Can not import map background: Height of both images must match the current map width: {}px
ja_jp: マップの背景をインポートできません。 両方の画像の高さは現在のマップの幅 ({} px) と一致する必要があります。
ru_ru: Невозможно импортировать фон карты: Высота обоих изображений должна соответствовать текущей ширине карты: {}px

source: new tilemapping for this chunk must contain {} tiles.
ja_jp: このチャンクの新しいタイルマッピングには {} タイルが含まれている必要があります。

source: Palette is invalid.
ja_jp: 無効なパレットです。
ru_ru: Палитра является недопустимой.

source: Palette index out of range.
ja_jp: パレットインデックスが範囲外です。
ru_ru: Индекс палитры вне диапазона.

source: This portrait does not compress well, the result size is greater than 800 bytes ({} bytes total). If you haven't done already, try applying the 'ProvideATUPXSupport' to install an optimized compression algorithm, which might be able to better compress this image.
ja_jp: このポートレートは圧縮できません。結果のサイズが 800 バイト (合計 {} バイト) を超えています。 最適化された圧縮アルゴリズム 'ProvideATUPXSupport' を適用することで、より適切に圧縮できる可能性があります。

source: A question must contain two XML sub-nodes: {}, {}
ja_jp: 質問には {}、{} という 2 つの XML サブノードが含まれている必要があります。
ru_ru: Вопрос должен содержать два подузла XML: {}, {}

source: Error
ja_jp: エラー
ru_ru: Ошибка

source: _OK
ja_jp: OK(_O)

source: Application to randomize the ROM of Pokémon Mystery Dungeon Explorers of Sky.
ja_jp: 「ポケモン不思議のダンジョン 空の探検隊」のROMの様々な要素をランダム化するアプリケーション。
ru_ru: Приложение для рандомизации ROM игры Pokémon Mystery Dungeon Explorers of Sky.

source: New version available: {version}
ja_jp: 新しいバージョンが利用可能です: {version}
ru_ru: Доступна новая версия: {version}

source: Update now
ja_jp: 今すぐ更新
ru_ru: Обновить сейчас

source: Search
ja_jp: 検索
ru_ru: Поиск

source: This will stop the randomization process and allow you to change settings again.
ja_jp: これによりランダマイズプロセスが停止し、設定を再度変更することができます。
ru_ru: Это остановит процесс рандомизации и позволит вам снова изменить настройки.

source: Cancel randomization?
ja_jp: ランダマイズを中止しますか？
ru_ru: Отменить рандомизацию?

source: _No
ja_jp: いいえ(_N)
ru_ru: _Нет

source: _Yes
ja_jp: はい(_Y)
ru_ru: _Да

source: Error while opening file ({}).
ja_jp: ファイルを開く際にエラーが発生しました。 ({})
ru_ru: Ошибка открытия файла ({}).
