Repository: SkyTemple/skytemple-randomizer
Catalog: skytemple_randomizer/data/locale/*/LC_MESSAGES/org.skytemple.Randomizer.po
Languages: ja_jp, ru_ru

source: Decimal not allowed at this position.
ru_ru: Десятичные числа недопустимы в этой позиции.

source: Constant not allowed at this position.
ru_ru: Константа недопустима в этой позиции.

source: Variable or constant not allowed at this position.
ru_ru: Переменная или константа недопустима в этой позиции.

source: String not allowed at this position.
ru_ru: Строка недопустима в этой позиции.

source: Invalid target for routine.
ru_ru: Недопустимая цель для рутины.

source: Position Marker arguments need to be an integer or a decimal with '.5' as the decimal places.
ru_ru: Аргументы маркера позиции должен быть целым числом или десятичным числом с '.5' в десятичном разряде.

source: A with(){} block needs at least one statement.
ru_ru: В блоке with(){} должна быть по крайней мере одна команда.

source: No value set for case menu condition.
ru_ru: Для case menu-условия не указано значение.

source: Value for case menu condition must be a string.
ru_ru: Значение для условия case menu должно быть строкой.

source: Value for case menu2 condition must not be a string.
ru_ru: Значение для условия case menu2 не должно быть строкой.

source: Can not import images as dungeon tilesets: The palettes of the images do not match. First image read that didn't match: "{basename}"
ru_ru: Невозможно импортировать изображения в качестве набора плиток подземелья: палитры изображений не совпадают. Первое прочитанное изображение с несовпадением: "{basename}"

source: Logic error: Tileset file {fn} was not loaded.
ru_ru: Ошибка логики: файл набора плиток {fn} не был загружен.

source: Image '{fn}' is too small ({tileset.width}x{tileset.height}px), must be at least {bx+w}x{by+h}px.
ru_ru: Изображение '{fn}' слишком маленькое ({tileset.width}x{tileset.height} пикселей), должно быть не менее {bx+w}x{by+h} пикселей.

source: Error in the XML: One of the animation frames doesn't have 16 colors. Each frame must have a value for each color.
ru_ru: Ошибка в XML: Один из кадров анимации содержит менее 16 цветов. Каждый кадр должен иметь значение для каждого цвета.

source: No match found for rule {orig_rule}. Input set correct?
ru_ru: Не найдено совпадений для правила {orig_rule}. Импортируемый набор верен?

source: Sprite File Size
ru_ru: Размер файла спрайта

source: Only 4bpp and 8bpp images are supported.
ru_ru: Поддерживаются только изображения 4bpp и 8bpp.

source: Invalid XML. Expected tag {tag}, got tag {ele.tag}.
ru_ru: Недопустимый XML. Ожидался тег {tag}, получен тег {ele.tag}.

source: Invalid XML. Expected attribute {attrib} for XML tag {ele.tag}.
ru_ru: Недопустимый XML. Ожидался атрибут {attrib} для тега XML {ele.tag}.

source: ARMIPS could not be found. Make sure, that 'armips' is inside your system's PATH.
ru_ru: Не удалось найти ARMIPS. Убедитесь, что 'armips' находится в PATH вашей системы.

source: ARMIPS reported an error while applying the patch.
ru_ru: ARMIPS сообщил об ошибке при применении патча.

source: The armips source file did not create a {OUT_BIN}.
ru_ru: Исходный файл armips не создал {OUT_BIN}.

source: To delete this effect, no items must use it.
ru_ru: Чтобы удалить этот эффект, ни один объект не должен его использовать.

source: Always
ru_ru: Всегда

source: F/W, Room; Key Door
ru_ru: П/С, комната, дверь с замком

source: Spawns a locked Key Door. If the fixed room id is &lt; 0xA5, this will be a Wall. Otherwise it will be Floor.
ru_ru: Создает закрытую дверь с замком. Если ID фиксированной комнаты &lt; 0xA5, это будет стена. Иначе, это будет пол.

source: F/W, Room; Key Door (Escort)
ru_ru: П/С, комната, дверь с замком (Сопровождение)

source: Spawns a locked Key Door (meant to be opened by an escort mission client). If the fixed room id is &lt; 0xA5, this will be a Wall. Otherwise it will be Floor.
ru_ru: Создает закрытую дверь с замком (которую должен открыть клиент миссии сопровождения). Если ID фиксированной комнаты &lt; 0xA5, это будет стена. Иначе это будет пол.

source: This portrait does not compress well, the result size is greater than {limit} bytes ({len(new_img_compressed)} bytes total). If you haven't done already, try applying the 'ProvideATUPXSupport' ASM patch to install an optimized compression algorithm, which might be able to better compress this image.If this still doesn't work, try the 'ExpandPortraitStructs' instead.
ru_ru: Этот портрет плохо сжимается, размер результата превышает {limit} байт ({len(new_img_compressed)} байт всего). Если вы еще не сделали этого, попробуйте применить ASM патч 'ProvideATUPXSupport', чтобы установить оптимизированный алгоритм сжатия, который, возможно, сможет лучше сжать это изображение. Если и это не сработает, попробуйте вместо этого использовать 'ExpandPortraitStructs'.

source: The list was extracted anyway. You can already edit it through SkyTemple, but it won't be used in game, until you successfully apply the patch.
ru_ru: Лист все равно был извлечен. Вы уже можете редактировать его в SkyTemple, но он не будет использоваться в игре, пока вы не сможете успешно применить патч.

source: Change the evolution system. After applying this, every single Pokémon will have two lists for their evolution and children, and different stat bonuses when a Pokémon evolves into them. This supposedly removes most of the particular cases the game handles for evolutions.
ru_ru: Меняет систему эволюции. После применения патча, у каждого покемона будет два списка - для эволюции и детей, которые могут быть у покемона, а также разные бонусы к статистикам при эволюции. Предполагается, что это устранит большинство особых случаев, которые игра использует для эволюций.

source: Pressing start in a dungeon toggles between automatic and manual mode. In manual mode, you can control your partners on their turns. You must apply the extra code overlay made by Frostbyte before applying this patch.
ru_ru: При нажатии кнопки "Старт" в подземелье происходит переключение между автоматическим и ручным режимом. В ручном режиме вы можете управлять своими напарниками во время их ходов. Перед установкой этого патча необходимо применить патч ExtraSpace, созданный Frostbyte.

source: Extracts special processes code and put it in files.
ru_ru: Извлекает код особых процессов и помещает его в файлы.

source: Makes the game always move the PoV to your partners when they use moves or are attacked, even if the partner is only one tile away, when far-off pals is enabled. Recommended for CTC since the PoV stays on your last pokemon at the end of a manual movement round without this, and CTC already reduces the amount of time the game pauses for between PoV changes.
ru_ru: Заставляет игру всегда перемещать PoV к вашим партнерам, когда они используют ходы или подвергаются атаке, даже если партнер находится всего в одной плитке от вас, если включена функция "Группа вдалеке". Рекомендуется для CTC, поскольку без этого PoV остается на вашем последнем покемоне в конце хода в ручном управлении, а CTC уже сокращает время паузы между сменой PoV.

source: Shorten Chimecho Team Assembly menu interactions. Adding, removing and making leader are now fast interactions that immediately go back to the team member selection menu.
ru_ru: Укорачивает взаимодействие с меню сборного пункта Чаймеко. Добавление, удаление и назначение лидера теперь являются быстрыми операциями, которые сразу же возвращают в меню выбора члена команды.

source: Implements move growth (PoC/Unfinished). Needs ActorAndLevelLoader, ExtractAnimData and ChangeMoveStatsDisplay patches. MoveGrowth patch must be (re-)applied after MoveShortcuts to combine both effects. The last version of ChangeMoveStatsDisplay must be used with this. May be incompatible if markfont.dat has been modified (except for ChangeMoveStatsDisplay) Makes all prior save files incompatible.
ru_ru: Реализует прокачку приемов (Проверка концепции/незавершен). Требуются патчи ActorAndLevelLoader, ExtractAnimData и ChangeMoveStatsDisplay. Патч MoveGrowth должен быть (повторно) применен после MoveShortcuts, чтобы объединить оба эффекта. Последняя версия ChangeMoveStatsDisplay должна быть использована с этим патчем. Может быть несовместим, если markfont.dat был изменен (кроме ChangeMoveStatsDisplay) Делает несовместимыми все предыдущие файлы сохранения.

source: Recommended for CTC. Without this patch, partners cannot trigger hidden traps - this balances the game, as making your partners dodge traps with manual movement is easy, but this patch is not recommended for mods which use pitfall traps, as they instakill partners which step on them.
ru_ru: Рекомендуется для CTC. Без этого патча напарники не могут активировать скрытые ловушки - это уравновешивает игру, так как заставить напарников уворачиваться от ловушек с помощью ручного движения очень просто, но этот патч не рекомендуется для модов, использующих ямы-ловушки, так как они немедленно убивают наступивших на них напарников.

source: Reduces the amount of time the game pauses for before changing the PoV, like when far-off pals is enabled, from 60 frames to 12. This is already applied in the CTC hack.
ru_ru: Уменьшает время паузы в игре перед сменой PoV, например, при включении функции "Группа вдалеке", с 60 кадров до 12. Уже применяется в патче CTC.

source: Removes the total body size check before entering a dungeon.
ru_ru: Убирает проверку общего размера покемонов перед входом в подземелье.

source: Changes Sprite Size and Sprite File Size values to be in each Pokémon's data.
ru_ru: Помещает Размер спрайта и Размер файла спрайта в данные каждого покемона.

source: Coroutines and regular routines can not be mixed in a script file.
ru_ru: Корутины и обычные рутины нельзя смешивать в файле сценария.

source: The number of parameters for {normal_op_code.name} must be at least {normal_op_code.params}, is {self._correct_param_list_len(in_op.params)}.
ru_ru: Количество параметров для {normal_op_code.name} должно быть не менее {normal_op_code.params}, в данный момент {self._correct_param_list_len(in_op.params)}.

source: The number of parameters for {op_code.name} must be {op_code.params}, is {self._correct_param_list_len(in_op.params)}.
ru_ru: Количество параметров для {op_code.name} должно быть {op_code.params}, в данный момент {self._correct_param_list_len(in_op.params)}.

source: The value '{}' can not be saved. Please use a value between -64.0 and 63.996 for fixed point numbers.
ru_ru: Значение {} не может быть сохранено. Пожалуйста, используйте значение между -64.0 и 63.996 для чисел с фиксированной запятой.

source: Could not compile script: All languages must have the same amount of strings.
ru_ru: Не удалось скомпилировать скрипт: Все языки должны иметь одинаковое количество строк.

source: The image to import can only use the first 12 palettes. Tried to use palette {}
ru_ru: Импортируемое изображение может использовать только 12 палитр. Данное изображение использует палитру {}

source: This portrait does not compress well, the result size is greater than {} bytes ({} bytes total). If you haven't done already, try applying the 'ProvideATUPXSupport' ASM patch to install an optimized compression algorithm, which might be able to better compress this image. If this still doesn't work, try the 'ExpandPortraitStructs' instead.
ru_ru: Этот портрет плохо сжимается, размер результата превышает {} байт ({} байт всего). Если вы еще не сделали этого, попробуйте применить ASM патч 'ProvideATUPXSupport', чтобы установить оптимизированный алгоритм сжатия, который, возможно, сможет лучше сжать это изображение. Если и это не сработает, попробуйте вместо этого использовать 'ExpandPortraitStructs'.

source: CSV File (*.csv)
ru_ru: CSV-файл (*.csv)

source: XML Document (*.xml)
ru_ru: XML-документ (*.xml)

source: JSON Document (*.json)
ru_ru: JSON-документ (*.json)

source: Any File
ru_ru: Любой файл

source: Seed
ru_ru: Зерно генерации

source: Wiki
ru_ru: Википедия

source: If enabled, Explorer Rank Levels are randomly unlocked. The cap for Master Rank unlock is max. 100000 points.
ru_ru: Если эта функция включена, количество очков для рангов исследователя будут случайными. Максимальный лимит для разблокировки ранга Мастера составляет 100000 очков.

source: Apply "UnusedDungeonChance" Patch
ru_ru: Применить патч 'UnusedDungeonChance'

source: SkyTemple Randomizer
ru_ru: Рандомайзер SkyTemple

source: Apply 'EditGuestPokemon' patch...
ru_ru: Применение патча 'EditGuestPokemon'...

source: Apply base patches by psy_commando and Frostbyte...
ru_ru: Применение базовых патчей от psy_commando и Frostbyte...
