Repository: SkyTemple/skytemple-randomizer
Catalog: skytemple_randomizer/data/locale/*/LC_MESSAGES/org.skytemple.Randomizer.po
Languages: ja_jp, ru_ru

source: If enabled, the randomizer uses faster implementations to manipulate the files in the ROM. This can affect the random values rolled during the randomization. This should only be disabled if you run into issues.
ja_jp: 有効にすると、ランダマイザーはより高速な実装を使用してROM内のファイルを操作します。 これはランダム化時に使用されるランダムな値に影響を与える可能性があります。 この設定は問題が発生した場合にのみ、無効化してください。
ru_ru: Если эта функция включена, рандомизатор использует более быстрые реализации для работы с файлами в ROM. Это может повлиять на случайные значения, выпадающие при рандомизации. Отключать эту функцию следует только в том случае, если вы столкнулись с проблемами.

source: Randomize Pokémon's IQ Groups
ja_jp: ポケモンのかしこさグループをランダム化
ru_ru: Рандомизировать IQ-группы покемонов

source: Assigns all Pokémon in the game a random IQ group.
ja_jp: すべてのポケモンにランダムなかしこさグループを割り当てます。
ru_ru: Присваивает всем покемонам в игре случайную IQ-группу.

source: Randomize IQ Gain
ja_jp: グミの好物をランダム化
ru_ru: Рандомизировать увеличение IQ

source: If enabled, the amount of belly the gummies fill and the amount of IQ they give are fully random for each type.
ja_jp: 有効にすると、グミを食べた時に回復するおなかの量とかしこさの量が各タイプの好物ごとにランダムになります。
ru_ru: Если эта функция включена, то количество сытости и количество IQ, которое дают жевательные резинки, полностью случайны для каждого типа.

source: IQ Skills
ja_jp: かしこさ
ru_ru: IQ-навыки

source: Randomize IQ Skill Unlocks
ja_jp: 習得に必要なかしこさ値をランダム化
ru_ru: Рандомизация разблокировки IQ-навыков

source: If enabled, IQ skills are unlocked at random IQ amounts. Item Master is always unlocked.
ja_jp: 有効にすると、ランダムなかしこさ値でかしこさを習得します。 どうぐマスターのみ、最初から習得します。
ru_ru: Если включено, IQ-навыки будут разблокироваться при случайном количестве IQ. Мастер предметов всегда разблокирован.

source: Keep Universal Skills
ja_jp: 汎用かしこさを維持
ru_ru: Сохранить универсальные навыки

source: If enabled, all skills that are included in all groups in the base game will also be added to all groups when randomizing. On top of that, even if "randomize IQ skill unlocks" is enabled, Course Checker, Item Catcher, Item Master, and Exclusive Move-User will always be unlocked from the start. However, Status Checker, Nontraitor, and Lava Evader will still have randomized IQ values.
ja_jp: 有効にすると、元のゲームの全グループに含まれるかしこさがランダム化時にすべてのグループに追加されます。 「習得に必要なかしこさ値をランダム化」が有効化されていても、コースかくにん、どうぐキャッチ、どうぐマスター、いどうゆうせんは常に最初から習得します。 ただし、じょうたいかくにん、うらぎらない、マグマがきらいのかしこさ値はランダム化されたままになります。
ru_ru: Если эта опция включена, то все навыки, входящие во все группы в базовой игре, будут также добавлены во все группы при рандомизации. Кроме того, даже если включена опция "рандомизация разблокировки IQ-навыков", Проверка Препятствий, Ловец Предметов, Мастер Предметов и Использующий Приёмы всегда будут разблокированы с самого начала. Однако Проверка Статуса, Не-Предатель и Избегатель Лавы все равно будут иметь случайное значения IQ.

source: Randomize IQ Groups
ja_jp: かしこさグループをランダム化
ru_ru: Рандомизировать IQ-группы

source: If enabled, IQ skills are assigned to random IQ groups (but at least one). Item Master is always in all groups.
ja_jp: 有効にすると、各かしこさはランダムなグループに割り当てられます (少なくとも1つ以上のグループ)。 どうぐマスターは必ずすべてのグループに追加されます。
ru_ru: Если включено, IQ-навыки назначаются в случайные IQ-группы (но не менее одного навыка в каждой группе). Мастер предметов всегда находится во всех группах.

source: Tactics
ja_jp: 作戦
ru_ru: Тактики

source: Randomize Tactics Unlock Levels
ja_jp: 作戦解禁レベルをランダム化
ru_ru: Рандомизировать уровни для разблокировки тактик

source: If enabled, tactics are fully unlocked at random levels. One random tactic is available from the beginning.
ja_jp: 有効にすると、作戦の解禁レベルがランダム化されます。 ランダムな作戦を1つだけ最初から解禁します。
ru_ru: Если эта функция включена, тактики полностью разблокируются на случайных уровнях. Одна случайная тактика доступна с самого начала.

source: Settings
ja_jp: 設定
ru_ru: Настройки

source: 1st Word
ja_jp: 1つ目の単語
ru_ru: 1-е слово

source: 2nd Word
ja_jp: 2つ目の単語
ru_ru: 2-е слово

source: _Text
ja_jp: テキスト(_T)
ru_ru: _Текст

source: Text Pools
ja_jp: テキストプール
ru_ru: Пулы текста

source: Configure what texts can be used for the quiz, location names and chapter titles.
ja_jp: 性格診断の質問に使用されるテキスト、地名、チャプタータイトルを設定します。
ru_ru: Настройка текстов, которые могут использоваться для теста личности, названий локаций и глав.

source: Configure the questions for the personality quiz
ja_jp: 性格診断の質問を設定
ru_ru: Настроить вопросы теста на личность

source: Randomize Location Names
ja_jp: 地名をランダム化
ru_ru: Рандомизировать имён локаций

source: Configure the pool of location names used for randomization
ja_jp: 地名のプール設定
ru_ru: Настроить пул имен локаций, используемых для рандомизации

source: Randomize Chapter Titles
ja_jp: チャプタータイトルをランダム化
ru_ru: Рандомизировать названия глав

source: Configure the pool of chapter titles used for randomization
ja_jp: チャプタータイトルのプール設定
ru_ru: Настроить пул названий глав, используемых для рандомизации

source: Full Text Randomization
ja_jp: 全テキストランダム化
ru_ru: Рандомизация всего текста

source: Randomize Main Text
ja_jp: メインテキストのランダム化
ru_ru: Рандомизировать основной текст

source: Randomize the game's main text file. This contains everything except for most of the overworld dialogue. The randomization is done in a way that (in most cases) similar categories of texts are shuffled. Potentially unstable!
ja_jp: ゲーム上のメインテキストファイルをランダム化します。 これにはオーバーワールドのほとんどのセリフを除くすべての内容が含まれます。ランダム化は (ほとんどの場合) 類似したカテゴリのテキストがシャッフルされる方法で行われます。 ※不安定であり、クラッシュする可能性があります！
ru_ru: Рандомизирует основной текстовый файл игры. В нем содержится все, кроме большинства диалогов в мире игры. Рандомизация производится таким образом, что (в большинстве случаев) схожие категории текстов перемешиваются. Потенциально нестабильно!

source: Randomize Story Dialogue
ja_jp: ストーリーダイアログのランダム化
ru_ru: Рандомизировать сюжетные диалоги

source: Randomize the game's overworld scene text. ALL overworld text is shuffled. Potentially unstable!
ja_jp: ゲーム上のオーバーワールドシーンのテキストをランダム化します。オーバーワールドのテキストはすべてシャッフルされます。 ※不安定であり、クラッシュする可能性があります！
ru_ru: Рандомизировать текст сцен мира игры. Перемешивается ВЕСЬ текст мира игры. Потенциально нестабильно!

source: Options
ja_jp: オプション
ru_ru: Опции

source: Enable Instant Text
ja_jp: インスタントテキストを有効化
ru_ru: Включить мгновенный текст

source: Text Replacement Algorithm
ja_jp: テキスト置換アルゴリズム
ru_ru: Алгоритм замены текста

source: Smart
ja_jp: スマート
ru_ru: Умный

source: Classic
ja_jp: クラシック
ru_ru: Классический

source: Controls how Pokémon and NPC names in texts are replaced. Classic: Algorithm that was used in the Randomizer prior to version 2.0. It may lead to some unrelated parts of text (such as parts of item names) being incorrectly replaced. Smart: Use a more exhaustive algorithm for replacing in-game mentions of NPCs. This is typically slower than doing a simple replacement.
ja_jp: 文章中のポケモンやNPCの名前をどのように置き換えるかを制御します。 クラシック: バージョン2.0以前のランダマイザーで使われていたアルゴリズム。 項目名の一部など、無関係な部分が誤って置換される可能性があります。 スマート: NPCに関するゲーム内のセリフを置き換えるために、より網羅的なアルゴリズムを使用します。 これは通常、単純な置換よりも遅くなります。
ru_ru: Регулирует замену имен покемонов и NPC в текстах. Классический: Алгоритм, который использовался в рандомайзере до версии 2.0. Может привести к тому, что некоторые несвязанные части текста (например, части названий предметов) будут ошибочно заменены. Умный: Использует более исчерпывающий алгоритм для замены упоминаний NPC в игре. Обычно медленнее, чем простая замена.

source: Remove Text
ja_jp: テキストを削除
ru_ru: Удалить текст

source: Add text
ja_jp: テキストを追加
ru_ru: Добавить текст

source: Item Names for "Blind Items" Mode
ja_jp: Blind Items モードの道具名
ru_ru: Названия предметов для режима "Слепые предметы"

source: Allowed Items
ja_jp: 許可された道具
ru_ru: Разрешённые предметы

source: Category Weights
ja_jp: カテゴリ係数
ru_ru: Вес категорий

source: T_weaks
ja_jp: 調整(_T)
ru_ru: Д_ополнительные настройки

source: Tip: Dungeon item randomization settings can be found under "Dungeons".
ja_jp: ヒント: ダンジョン内の道具ランダム化の設定は「ダンジョン」タブにあります。
ru_ru: Совет: Настройки рандомизации предметов в подземельях можно найти в разделе "Подземелья".

source: Item Randomization Algorithm
ja_jp: 道具ランダム化のアルゴリズム
ru_ru: Алгоритм рандомизации предметов

source: Balanced
ja_jp: バランス
ru_ru: Сбалансированный

source: Controls how item lists are randomly filled. Balanced: Tries to make it equally likely to find any item in the game, the only exception being Poké which is boosted. Classic: Algorithm that was used in the Randomizer prior to version 1.4. It doesn't attempt to balance out the different item categories, making items from categories with fewer total items easier to find.
ja_jp: 道具リストをランダム化する方法を制御します。 バランス: ゲーム内のどの道具も同じ確率で見つかるようにします。 ブーストされたポケは例外です。 クラシック: バージョン 1.4 以前のランダマイザーで使用されていたアルゴリズム。 さまざまなカテゴリのバランスを取ろうとはしていません。 合計アイテム数が少ないカテゴリの道具を見つけやすくします。
ru_ru: Управляет случайным заполнением списков предметов. Сбалансированный: Старается сделать так, чтобы вероятность найти любой предмет в игре была одинаковой, единственное исключение - Поке, вероятность их нахождения увеличено. Классический: Алгоритм, который использовался в рандомайзере до версии 1.4. Он не пытается сбалансировать различные категории предметов, делая предметы из категорий с меньшим общим количеством предметов более легкими для поиска.

source: Randomize Treasure Town shop and dungeon rewards
ja_jp: トレジャータウンの店とダンジョン報酬をランダム化
ru_ru: Рандомизация магазинов Города сокровищ и наград подземелий

source: Allowed Items &amp; Category Weights
ja_jp: 許可された道具 &amp; カテゴリウェイト
ru_ru: Разрешенные предметы &amp; вес категорий

source: "Blind Items" Mode
ja_jp: Blind Items モード
ru_ru: Режим "Слепые предметы"

source: Enable "Blind Items" mode: Item names are replaced with random names. Icons and costs are randomized. Descriptions are replaced with placeholder text.
ja_jp: Blind Moves モードの有効化: 道具名がランダムな名前に置き換えられます。アイコンや買値はランダムになります。 道具の説明はプレースホルダーテキストに置き換えられます。
ru_ru: Включите режим «Слепые предметы»: названия предметов заменяются случайными именами. Значки и стоимость рандомизируются. Описания заменяются текстом-заполнителем.

source: Configure item names in "Blind Items" Mode
ja_jp: Blind Items モードの道具名設定
ru_ru: Настройка имен предметов в режиме "Слепые предметы"

source: Utilities
ja_jp: ユーティリティ
ru_ru: Утилиты

source: Download Missing Portraits &amp; Sprites
ja_jp: 不足している顔グラフィック &amp; スプライトをダウンロード
ru_ru: Скачать недостающие портреты &amp; спрайты

source: Downloaded from SpriteCollab (sprites.pmdcollab.org)
ja_jp: SpriteCollab (sprites.pmdcollab.org) からダウンロード
ru_ru: Скачано из SpriteCollab (sprites.pmdcollab.org)

source: Patches
ja_jp: パッチ
ru_ru: Патчи

source: Miscellaneous
ja_jp: その他
ru_ru: Прочее

source: Music
ja_jp: BGM
ru_ru: Музыка

source: Explorer Rank
ja_jp: 探検隊ランク
ru_ru: Ранг исследователя

source: Currently loaded ROM:
ja_jp: 読込中のROM:
ru_ru: Загруженный в настоящее время ROM:

source: Welcome to the Randomizer! Click the "Randomize" button to randomize your ROM, or configure options by selecting a page.
ja_jp: ランダマイザーへようこそ！ 「Randomize」ボタンをクリックしてROMをランダマイズするか、ページを選択してオプションを設定します。
ru_ru: Добро пожаловать в рандомайзер! Нажмите кнопку "Рандомизировать", чтобы рандомизировать ваш ROM, или настройте параметры, выбрав страницу.

source: Your settings will be discarded and will be replaced by default settings matching the new ROM you open. Make sure to save your settings if you need them.
ja_jp: 設定した内容は破棄され、開いたROMと一致するデフォルトの設定に置き換えられます。 必要な場合は、設定を保存してください。
ru_ru: Ваши настройки будут удалены и заменены настройками по умолчанию, соответствующими новому ROM, который вы откроете. Не забудьте сохранить настройки, если они вам понадобятся.

source: Close current ROM?
ja_jp: ROMを閉じます。よろしいですか？
ru_ru: Закрыть текущий ROM?

source: Close the currently opened ROM and load a new one.
ja_jp: 現在開いている ROM を閉じて、新しい ROM をロードします。
ru_ru: Закрыть ROM, открытый в данный момент, и загрузить новый.

source: _Start
ja_jp: 開始(_S)
ru_ru: _Начать

source: Help (online)
ja_jp: ヘルプ (オンライン)
ru_ru: Справка (онлайн)

source: _Randomize
ja_jp: Randomize(_R)
ru_ru: _Рандомизировать

source: Load ROM
ja_jp: ROMを読み込む
ru_ru: Загрузить ROM

source: Load {}
ja_jp: {} を読み込む
ru_ru: Загрузить {}

source: Load another ROM
ja_jp: 別のROMを読み込む
ru_ru: Загрузить другой ROM

source: Failed to load ROM: Error while opening file ({}).
ja_jp: ROM読み込み失敗: ファイルを開く際にエラーが発生しました。 ({})
ru_ru: Не удалось загрузить ROM: ошибка открытия файла ({}).

source: Failed to load ROM:
ja_jp: ROM の読み込みに失敗しました。
ru_ru: Не удалось загрузить ROM:

source: Are you sure you provided a ROM? A ROM usually has the file extension ".nds".
ja_jp: 正しい ROM を選択しましたか？ROM には通常、ファイル拡張子「.nds」が付いています。
ru_ru: Вы уверены, что вы предоставили ROM? ROM обычно имеет расширение файла ".nds".

source: Get started by loading a ROM.
ja_jp: ROM を読み込んで下さい。
ru_ru: Начните с загрузки ROM.

source: Apply 'DisableTips' patch...
ja_jp: パッチ 'DisableTips' を適用中...
ru_ru: Применение патч 'DisableTips'...

source: Enabling "Blind Items" Mode...
ja_jp: Blind Items モードを有効にしています...
ru_ru: Включение режима "Слепые предметы"...

source: Enabling "Blind Moves" Mode...
ja_jp: Blind Moves モードを有効にしています...
ru_ru: Включение режима "Слепые приёмы"...

source: Apply 'ActorAndLevelLoader' patch...
ja_jp: パッチ 'ActerAndLevelLoader' を適用中...
ru_ru: Применение патча 'ActorAndLevelLoader'...

source: Updating bosses...
ja_jp: ボスを更新中...
ru_ru: Обновление боссов...

source: Updating bazaar monsters...
ja_jp: ひみつのバザーのポケモンを更新中...
ru_ru: Обновление покемонов в базаре...

source: Randomizing Chapter Names...
ja_jp: チャプター名をランダマイズ中...
ru_ru: Рандомизация названий глав...

source: Fixing dungeon errors...
ja_jp: ダンジョンのエラーを修正中...
ru_ru: Исправление ошибок подземелий...

source: Randomizing dungeon items...
ja_jp: ダンジョンに落ちている道具をランダマイズ中...
ru_ru: Рандомизация предметов в подземельях...

source: Randomizing dungeon traps...
ja_jp: ダンジョンに出現する罠をランダマイズ中...
ru_ru: Рандомизация ловушек подземелий...

source: Randomizing dungeons...
ja_jp: ダンジョンをランダマイズ中...
ru_ru: Рандомизация подземелий...

source: Unlocking dungeons...
ja_jp: ダンジョンのロックを解除中...
ru_ru: Разблокировка подземелий...

source: Randomizing rank data...
ja_jp: 探検隊ランクデータをランダマイズ中...
ru_ru: Рандомизация данных рангов...

source: Randomizing Boss Floor Layouts...
ja_jp: ボス部屋のレイアウトをランダマイズ中...
ru_ru: Рандомизация планировки этажей с боссом...

source: Fixing Quicksand Pit...
ja_jp: 「りゅうさのどうくつ さいしんぶ」の修正中...
ru_ru: Исправление Зыбучей Ямы...

source: Apply patches...
ja_jp: パッチを適用中...
ru_ru: Применение патчей...

source: Randomizing global item lists...
ja_jp: グローバル道具リストをランダマイズ中...
ru_ru: Рандомизация глобальных списков предметов...

source: Apply 'EditExtraPokemon' patch...
ja_jp: パッチ 'EditExtraPokemon' を適用中...

source: Updating guest Pokémon...
ja_jp: 途中加入ポケモンを更新中...
ru_ru: Обновление гостевых покемонов...

source: Updating guest Pokémon movesets...
ja_jp: 途中加入ポケモンの習得技を更新中...
ru_ru: Обновление набора приёмов гостевых покемонов...

source: Randomizing tactics...
ja_jp: 作戦をランダマイズ中...
ru_ru: Рандомизация тактик...

source: Randomizing IQ gain...
ja_jp: グミの好物をランダマイズ中...
ru_ru: Рандомизация увеличения IQ...

source: Randomizing IQ groups...
ja_jp: かしこさグループをランダマイズ中...
ru_ru: Рандомизация групп IQ...

source: Randomizing IQ skills...
ja_jp: かしこさをランダマイズ中...
ru_ru: Рандомизация IQ-навыков...

source: Randomizing Location Names...
ja_jp: 地名をランダマイズ中...
ru_ru: Рандомизация имён локаций...

source: Replacing script text that mentions locations...
ja_jp: 地名を示すスクリプトテキストを置換中...
ru_ru: Замена текста сценариев, где упоминаются локации...

source: Enabling instant text...
ja_jp: インスタントテキストを有効化中...
ru_ru: Включение мгновенного текста...

source: Randomizing Pokémon data...
ja_jp: ポケモンデータをランダマイズ中...
ru_ru: Рандомизация данных покемонов...

source: Randomizing Level-Up movesets...
ja_jp: レベル習得技をランダマイズ中...
ru_ru: Рандомизация наборов приёмов при повышении уровня...

source: Randomizing TMs/HMs...
ja_jp: 技マシンをランダマイズ中...
ru_ru: Рандомизация TM/HM...

source: Randomizing TM/HM movesets...
ja_jp: 技マシン習得技をランダマイズ中...
ru_ru: Рандомизация наборов приёмов, изучаемых из TM/HM...

source: Randomizing NPC actor list...
ja_jp: NPC アクターリストをランダマイズ中...
ru_ru: Рандомизация списка NPC актёров...

source: Replacing main text that mentions NPCs...
ja_jp: NPCに関するメインテキストを置換中...
ru_ru: Замена основного текста, где упоминаются NPC...

source: Replacing script text that mentions NPCs...
ja_jp: NPCに関するスクリプトテキストを置換中...
ru_ru: Замена текста сценариев где упоминаются NPC...

source: Cloning missing NPC portraits...
ja_jp: 不足しているNPCの顔グラフィックをクローン中...
ru_ru: Клонирование недостающих портретов NPC...

source: Randomizing Titlescreen Music...
ja_jp: タイトル画面のBGMをランダマイズ中...
ru_ru: Рандомизация музыки главного меню...

source: Randomizing Overworld Music...
ja_jp: オーバーワールドBGMをランダマイズ中...
ru_ru: Рандомизация музыки мира игры...

source: Apply base patches by psy_commando and End45...
ja_jp: psy_commando と End45 による基本パッチの適用中...

source: Apply 'MoveShortcuts' patch...
ja_jp: パッチ 'MoveShortcuts' を適用中...
ru_ru: Применение патча 'MoveShortcuts'...

source: Apply 'UnusedDungeonChance' patch...
ja_jp: パッチ 'UnusedDungeonChance' を適用中...
ru_ru: Применение патча 'UnusedDungeonChance'...

source: Apply 'Complete Team Control' patches...
ja_jp: パッチ 'Complete Team Control' を適用中...
ru_ru: Применение патча 'Complete Team Control'...

source: Apply personality test patches...
ja_jp: 性格診断パッチを適用中...
ru_ru: Применение патчей для теста личности...

source: Apply 'FixMemorySoftlock' patch...
ja_jp: パッチ 'FixMemorySoftlock' を適用中...
ru_ru: Применение патча 'FixMemorySoftlock'...

source: Apply 'DisarmOneRoomMonsterHouses' patch...
ja_jp: パッチ 'DisarmOneRoomMonsterHouses' を適用中...
ru_ru: Применение патча 'DisarmOneRoomMonsterHouses'...

source: Downloading portraits and sprites... {}/{}
ja_jp: 不足している顔グラフィックとスプライトをダウンロード中... {}/{}
ru_ru: Скачивание портретов и спрайтов... {}/{}

source: Randomizing Quiz...
ja_jp: 性格診断の質問をランダマイズ中...
ru_ru: Рандомизация теста...

source: Updating special recruitment table...
ja_jp: イベント勧誘テーブルを更新中...
ru_ru: Обновление особой таблицы рекрутов...

source: Loading Seed Info...
ja_jp: Seed 情報を読み込み中...
ru_ru: Загрузка информации о зерне генерации...

source: Placing Info NPC...
ja_jp: NPC を配置中...
ru_ru: Размещение информации о NPC...

source: Finishing up...
ja_jp: 終了処理中...
ru_ru: Завершение...

source: Updating special episode Pokémon...
ja_jp: スペシャルエピソードのポケモンを更新中...
ru_ru: Обновление покемонов в особых эпизодах...

source: Updating special episode Pokémon movesets...
ja_jp: スペシャルエピソードのポケモンの習得技を更新中...
ru_ru: Обновление набора приёмов покемонов в особых эпизодах...

source: Randomizing Partner Starters...
ja_jp: パートナーをランダマイズ中...
ru_ru: Рандомизация списка покемонов, которых можно выбрать как партнёра...

source: Randomizing Player Starters...
ja_jp: 主人公をランダマイズ中...
ru_ru: Рандомизация списка покемонов, которых можно выбрать как игрока...

source: Cloning missing starter portraits...
ja_jp: 不足している主人公・パートナーの顔グラフィックをクローン中...
ru_ru: Клонирование недостающих портретов стартовых покемонов...

source: Randomizing all main text...
ja_jp: すべてのテキストをランダマイズ中...
ru_ru: Рандомизация всего основного текста...

source: Randomizing all script text: Reading strings...
ja_jp: スクリプトテキストのランダマイズ: 文字列の読み込み中...
ru_ru: Рандомизация всего текста сценария: чтение строк...

source: Randomizing all script text: Writing strings...
ja_jp: スクリプトテキストのランダマイズ: 文字列の書き込み中...
ru_ru: Рандомизация всего текста сценария: запись строк...

source: Randomizing...
ja_jp: ランダマイズ中...
ru_ru: Рандомизация...

source: Saving scripts...
ja_jp: スクリプトを保存中...
ru_ru: Сохранение сценариев...

source: Friend Rescue Set Phrases
ru_ru: Спасение друга: выбираемые фразы

source: Friend Rescue Message Input Strings
ru_ru: Спасение друга: строки ввода сообщения

source: Prize Ticket Strings
ru_ru: Строки призовых билетов

source: Job Debriefing Related Strings (Primary)
ru_ru: Строки, связанные с подведением итогов работы (Основные)

source: Job Debriefing Related Strings (Secondary)
ru_ru: Строки, связанные с подведением итогов работы (Вторичные)

source: Storage Space Full Strings
ru_ru: Строки о заполненном хранилище

source: Treasure Bag Full Strings
ru_ru: Строки о заполненной сумке с ценностями

source: Croagunk Swap Shop Strings
ru_ru: Строки Обменной Лавки Кроганка

source: Xatu Appraisal Strings
ru_ru: Строки пункта оценки Ксату

source: Electivire Link Shop Strings
ru_ru: Строки связь-лавки Элективайра

source: Chimecho Assembly Strings
ru_ru: Строки сборного пункта Чаймеко

source: Luminous Spring Strings
ru_ru: Строки Сияющего Источника

source: Diary Strings
ru_ru: Строки из дневников

source: Level Up Strings
ru_ru: Строки повышения уровня

source: Exclusive Items Strings
ru_ru: Строки эксклюзивных предметов

source: Demo Dungeon Strings
ru_ru: Строки демо подземелья

source: Sky Jukebox Menu Strings
ru_ru: Строки меню Небесного Проигрывателя

source: Music Tracks
ru_ru: Музыкальные треки

source: Personality Quiz Results
ru_ru: Результаты теста на характер

source: Personality Quiz Aura
ru_ru: Тест о личности, аура

source: Partner Selection Strings
ru_ru: Строки выбора спутника

source: New Game Welcome
ru_ru: Приветствие в начале игры

source: Personality Quiz Aura Finger Move
ru_ru: Тест на личность, определение ауры: сдвиг пальца

source: Dungeon Defeated Dialogue Strings
ru_ru: Строки диалогов при поражении в подземелии

source: Dungeon Cleared Dialogue Strings
ru_ru: Строки диалогов при успешном завершении подземелья

source: Dungeon Item Usage (Bag)
ru_ru: Использование предметов в подземелье (сумка)

source: Floor-Wide Status
ru_ru: Статус, длящийся весь этаж

source: Story Mission Objectives
ru_ru: Цели миссии

source: Dungeon Potential Recruit Strings
ru_ru: Строки возможных рекрутов в подземелье

source: Nothing At Feet String
ru_ru: Строки об отсутствии предметов под ногами

source: Something's Stirring Strings
ru_ru: Строки "Что-то движется"

source: Dungeon New Recruit Strings
ru_ru: Строки о новых рекрутах

source: PP Recover Strings
ru_ru: Строки о восстановлении PP

source: Item Became Sticky String
ru_ru: Строки о предмете, ставшим липким

source: Status Names and Descriptions
ru_ru: Названия и описания статусов

source: Wireless Connection Strings
ru_ru: Строки беспроводного подключения

source: Friend Code Strings
ru_ru: Строки кода друга

source: Wonder Mail S Strings
ru_ru: Строки Чудо Почты S

source: Mission Detail Strings
ru_ru: Строки с деталями миссии

source: Mission Objective Strings
ru_ru: Строки с целями миссии

source: Debug Strings (Mission)
ru_ru: Отладочные строки (Миссия)

source: Debug Strings (Scripts)
ru_ru: Отладочные строки (Скрипты)

source: Debug Strings (Menu)
ru_ru: Отладочные строки (Меню)

source: Debug Strings (Status)
ru_ru: Отладочные строки (Статус)

source: Debug Strings (Dungeon 1)
ru_ru: Отладочные строки (Подземелье 1)

source: Debug Strings (Dungeon 2)
ru_ru: Отладочные строки (Подземелье 2)

source: Debug Strings (Message)
ru_ru: Отладочные строки (Сообщение)

source: Debug Strings (Triggers)
ru_ru: Отладочные строки (Триггеры)

source: Debug Strings (Bulletin 1)
ru_ru: Отладочные строки (Доска 1)

source: Debug Strings (Bulletin 2)
ru_ru: Отладочные строки (Доска 2)

source: Debug Strings (Mail)
ru_ru: Отладочные строки (Письмо)

source: Debug Strings (Name)
ru_ru: Отладочные строки (Имя)

source: Debug Strings (Parameters)
ru_ru: Отладочные строки (Параметры)

source: Game and Dungeon Hints
ru_ru: Подсказки по игре и подземельям

source: Adventure Log Entries
ru_ru: Записи в журнале приключений

source: Staff Roll 1
ru_ru: Титры 1

source: Staff Roll 2
ru_ru: Титры 2

source: Staff Roll 3
ru_ru: Титры 3

source: New Pokemon Names
ru_ru: Новые имена покемонов

source: New Pokemon Categories
ru_ru: Новые категории покемонов

source: Dungeon Defeated Dialog Strings
ru_ru: Строки диалогов при поражении в подземелии

source: Dungeon Cleared Dialog Strings
ru_ru: Строки диалогов при успешном завершении подземелья

source: Integer not allowed at this position.
ru_ru: Целое число недопустимо в этой позиции.
