Repository: SkyTemple/skytemple-randomizer
Catalog: skytemple_randomizer/data/locale/*/LC_MESSAGES/org.skytemple.Randomizer.po
Languages: ja_jp, ru_ru

source: The path of the ROM file needs to end in '.nds'.
ja_jp: ROM ファイルのパスは '.nds' で終わる必要があります。

source: Randomizing... ({}%)
ja_jp: ランダマイズ中... ({}%)
ru_ru: Рандомизация... ({}%)

source: Randomizing failed!
ja_jp: ランダマイズ失敗
ru_ru: Рандомизация не удалась!

source: Error: {}
ja_jp: エラー: {}
ru_ru: Ошибка: {}

source: Randomizing complete!
ja_jp: ランダマイズ完了！
ru_ru: Рандомизация завершена!

source: Randomization Progress
ja_jp: 進行状況
ru_ru: Прогресс рандомизации

source: Select Output File & Start Randomization
ja_jp: 出力先を選択してランダマイズ
ru_ru: Выбрать выходной файл и начать рандомизацию

source: Input ROM
ja_jp: ROM を読み込む
ru_ru: Входной ROM

source: Open Folder in File Browser
ja_jp: ファイルブラウザーでフォルダーを開く
ru_ru: Открыть папку в файловом браузере

source: Output ROM
ja_jp: ROM を出力
ru_ru: Выходной ROM

source: (Not yet chosen.)
ja_jp: (選択されていません)
ru_ru: (Ещё не выбран.)

source: Game Region
ja_jp: リージョン
ru_ru: Регион игры

source: Randomizer Version
ja_jp: ランダマイザーバージョン
ru_ru: Версия программы

source: About
ja_jp: SkyTemple について
ru_ru: О программе

source: _Dungeons
ja_jp: ダンジョン(_D)
ru_ru: _Подземелья

source: Randomization Mode
ja_jp: ランダマイズモード
ru_ru: Режим рандомизации

source: Fully random
ja_jp: 完全ランダム
ru_ru: Полностью случайный

source: Consistent per Dungeon
ja_jp: ダンジョン毎
ru_ru: Каждое подземелье постоянно

source: Specify if you want to randomize dungeon floors fully random or if you want to have some aspects of floors in a dungeon the same. If you choose "Consistent per Dungeon" aspects like the music and tileset will be the same for all floors of a dungeon.
ja_jp: ダンジョンのフロアを完全にランダム化するか、一部の要素のみ同じにするかを指定します。 「ダンジョン毎」を選択すると、BGMやタイルセットなどはダンジョン毎にすべてのフロアで同じになります。
ru_ru: Укажите, хотите ли вы рандомизировать этажи подземелья полностью случайным образом или хотите, чтобы некоторые аспекты этажей в подземелье были одинаковыми. Если вы выберете "Каждое подземелье постоянно", то такие аспекты, как музыка и набор плиток, будут одинаковыми для всех этажей подземелья.

source: Randomization Settings
ja_jp: ランダマイズ設定
ru_ru: Параметры рандомизации

source: Chance Thresholds
ja_jp: 確率しきい値
ru_ru: Пороги вероятностей

source: Per-Dungeon Settings
ja_jp: 各ダンジョンの設定
ru_ru: Настройки для каждого подземелья

source: Random Weather Chance
ja_jp: ランダム天気の確率
ru_ru: Шанс случайной погоды

source: in percent (%)
ja_jp: パーセント (%)
ru_ru: в процентах (%)

source: Chance of applying a random weather that isn't "clear" to each floor. If the chance doesn't pass, "clear" weather will be used instead. This is only relevant if weather randomization is enabled.
ja_jp: 各フロアにランダムな天気を適用する確率。確率から外れた場合、天気は「はれ」が適用されます。 これは天候のランダム化が有効な場合にのみ反映されます。
ru_ru: Шанс применить случайную погоду, не являющуюся "ясной", к каждому этажу. Если шанс не выпадет, будет использована "ясная" погода. Это актуально только если включена рандомизация погоды.

source: Max. Monster House Chance
ja_jp: モンスターハウス最大スポーン率
ru_ru: Макс. шанс Засады монстров

source: Monster house chance will be randomized between 0% and this value (inclusive).
ja_jp: モンスターハウスのスポーン率は 0% からこの値までの範囲でランダム化されます。
ru_ru: Шанс появления Засады монстров будет рандомизирован в диапазоне от 0% до этого значения (включительно).

source: Max. Hidden Stairs Chance
ja_jp: ひみつのかいだん最大スポーン率
ru_ru: Макс. шанс появления Скрытой лестницы

source: Hidden stairs chance will be randomized between 0% and this value (inclusive).
ja_jp: ひみつのかいだんのスポーン率は 0% からこの値までの範囲でランダム化されます。
ru_ru: Шанс появления Скрытой лестницы будет рандомизирован в диапазоне от 0% до этого значения (включительно).

source: Max. Kecleon Shop Chance
ja_jp: カクレオンのみせ最大スポーン率
ru_ru: Макс. шанс появления магазина Кеклеона

source: Kecleon shop chance will be randomized between 0% and this value (inclusive).
ja_jp: カクレオンのみせのスポーン率は 0% からこの値までの範囲でランダム化されます。
ru_ru: Шанс появления магазина Кеклеона будет рандомизирован в диапазоне от 0% до этого значения (включительно).

source: Max. Sticky Item Chance
ja_jp: ネバついた道具最大スポーン率
ru_ru: Макс. шанс липкого предмета

source: Sticky item chance will be randomized between 0% and this value (inclusive).
ja_jp: ネバついた道具のスポーン率は 0% からこの値までの範囲でランダム化されます。
ru_ru: Шанс появления липкого предмета будет рандомизирован в диапазоне от 0% до этого значения (включительно).

source: Unlock at Start
ja_jp: 最初から解禁
ru_ru: Разблокировать в начале

source: Randomize IQ
ja_jp: かしこさをランダム化
ru_ru: Рандомизировать IQ

source: Spawn Monster Houses
ja_jp: モンスターハウス
ru_ru: Создавать Засады Монстров

source: Randomize Weather
ja_jp: 天気をランダム化
ru_ru: Рандомизировать погоду

source: Randomize
ja_jp: ランダム化
ru_ru: Рандомизировать

source: Here you can decide which dungeons you want to have affected by the randomization and whether or randomize weather or not. You can also disable Monster Houses for dungeons (recommended for early game). Additionally you can force dungeons to be unlocked. Please note that entering story dungeons prematurely can mess with the game's story progression.
ja_jp: ランダム化の影響を受けるダンジョンと、天気をランダム化するかどうかを決めることができます。 ダンジョンのモンスターハウスを無効にすることもでき、ゲームの序盤に行くことになるダンジョンは無効化することを推奨します。また、ダンジョンを強制的にアンロックすることもできます。 本来と異なる順番でストーリーダンジョンに突入した場合、ストーリーの進行に影響を及ぼす可能性があります。
ru_ru: Здесь вы можете решить какие подземелья должны быть затронуты рандомизацией, а также должна ли быть случайной погода. Также вы можете отключить Засады Монстров в подземельях(рекомендуется в начале игры). Также вы можете принудительно открыть подземелья. Обратите внимание: ранний вход в сюжетное подземелье может нарушить сюжетную прогрессию игры.

source: Failed to import: Error while opening file ({}).
ja_jp: インポートに失敗しました。ファイルを開く際にエラーが発生しました ({})。
ru_ru: Импортирование не удалось: ошибка открытия файла ({}).

source: Missing dungeon ID in CSV
ja_jp: CSV にダンジョン ID が見つかりません。
ru_ru: Отсутствует ID подземелья в CSV

source: Failed to import. Make sure your CSV matches the same format as with the export button. Details: {}
ja_jp: インポートに失敗しました。CSVがエクスポートボタンに書かれた形式と同じであることを確認してください。 詳細: {}
ru_ru: Не удалось импортировать. Убедитесь, что ваш CSV фай имеет тот же формат, что и при использовании кнопки экспортирования. Детали: {}

source: Failed to export: Error while opening file ({}).
ja_jp: エクスポートに失敗しました。ファイルを開く際にエラーが発生しました ({})。
ru_ru: Экспортирование не удалось: ошибка открытия файла({}).

source: Failed to export. Details: {}
ja_jp: エクスポートに失敗しました。 詳細: {}
ru_ru: Экспортирование не удалось. Детали: {}

source: Import from CSV
ja_jp: CSV からインポート
ru_ru: Импортировать из CSV

source: Export to CSV
ja_jp: CSV にエクスポート
ru_ru: Экспортировать в CSV

source: Randomize Layouts, Tilesets and Music
ja_jp: レイアウト、タイルセット、BGMをランダム化
ru_ru: Рандомизировать планировку, наборы плиток и музыку

source: Whether or not to randomize general aspects of the dungeon's layout. This also includes tileset and music and most general settings.
ja_jp: ダンジョンレイアウトの一般的なプロパティをランダム化するかどうか。 これには、タイルセットとBGM、およびほとんどの一般的な設定も含まれます。
ru_ru: Нужно ли рандомизировать общие аспекты планировки подземелья. Сюда также входят набор плиток, музыка и большинство общих настроек.

source: Whether or not to randomize weather. The chances of this occurring can be changed under 'Chance Thresholds'.
ja_jp: 天気をランダム化するかどうか。 このオプションが適用される確率は「確率しきい値」で変更できます。
ru_ru: Следует ли рандомизировать погоду. Шанс происхождения этого может быть изменен в "Порогах вероятностей".

source: Randomize Dungeon Items
ja_jp: ダンジョンに落ちている道具をランダム化
ru_ru: Рандомизировать предметы в подземельях

source: Whether or not to randomize items on the floor, in dungeon shops, in monster houses and buried.
ja_jp: フロアに落ちている道具、ダンジョン内の店の商品、モンスターハウス、壁に埋もれている道具をランダム化するかどうか。
ru_ru: Следует ли рандомизировать предметы на этаже, в магазинах внутри подземелья, в засадах монстров и в стенах.

source: Randomize Pokémon Spawns
ja_jp: ポケモンのスポーンをランダム化
ru_ru: Рандомизировать список покемонов в подземельях

source: Whether or not to randomize Pokémon spawns. Levels of Pokémon on a floor are randomized to be -/+3 of the original game's weakest/strongest Pokémon on the floor.
ja_jp: ポケモンのスポーンをランダム化するかどうか。 フロアにいるポケモンのレベルは、元のゲームでフロアにいる最も低レベル/最も高レベルのポケモンの-3/+3になるようにランダム化されます。
ru_ru: Нужно ли рандомизировать списки покемонов в подземельях. Уровни покемонов на этаже рандомизируются таким образом, чтобы они составляли -/+3 от уровня самого слабого/сильного покемона на этаже в оригинальной игре.

source: Randomize Traps
ja_jp: 罠のランダム化
ru_ru: Рандомизировать ловушки

source: Whether or not to randomize traps and Wonder Tile spawn chances.
ja_jp: 罠とふしぎなゆかのスポーン率をランダム化するかどうか。
ru_ru: Нужно ли рандомизировать шансы появления ловушек и Чудо-Клетки.

source: Randomize Boss Room Layouts
ja_jp: ボス部屋のレイアウトをランダム化
ru_ru: Рандомизировать планировки этажей с боссом

source: Whether or not to replace all boss fight rooms with randomly generated room layouts. THIS MAY BE UNBALANCED OR UNSTABLE.
ja_jp: すべてのボス部屋をランダムに生成されたレイアウトに置き換えるかどうか。 ※バランスが取れていない、もしくは不安定である可能性があります
ru_ru: Нужно ли заменить все комнаты для боя с боссами на случайно сгенерированные комнаты. МОЖЕТ БЫТЬ НЕСБАЛАНСИРОВАННЫМ ИЛИ НЕСТАБИЛЬНЫМ.

source: Floor Count
ja_jp: フロア数
ru_ru: Количество этажей

source: Max. Removal of Floors
ja_jp: フロア数の最大削除量
ru_ru: Макс. удаление этажей

source: Maximum amount of change in floor count in the lower direction (eg. if this is 10%, a dungeon can have up to 10% less floors). A dungeon will never have less than 1 floor. This setting has no effect if layouts are not randomized.
ja_jp: フロア数を減らす最大変化量。例えば、これが 10% の場合、ダンジョンのフロア数は最大 10% 少なくなります。 ダンジョンのフロア数が 1F 未満になることはありません。 レイアウトのランダム化が有効化されていない場合、この設定は適用されません。
ru_ru: Максимальное изменение количества этажей в меньшую сторону (например, если это значение равно 10%, то в подземелье может быть до 10% меньше этажей чем в оригинальной игре). В подземелье никогда не будет меньше 1 этажа. Эта настройка не влияет, если планировка не рандомизирована.

source: Max. Addition of Floors
ja_jp: フロア数の最大追加量
ru_ru: Макс. добавление этажей

source: Maximum amount of change in floor count in the upper direction (eg. if this is 10%, a dungeon can have up to 10% more floors). A dungeon will never have more than 99 floors. This setting has no effect if layouts are not randomized.
ja_jp: フロア数を増やす最大変化量。例えば、これが 10% の場合、ダンジョンのフロア数は最大 10% 増えます。 ダンジョンのフロア数が 99F を超えることはありません。 レイアウトのランダム化が有効化されていない場合、この設定は適用されません。
ru_ru: Максимальное изменение количества этажей в большую сторону (например, если это значение равно 10%, то в подземелье может быть до 10% больше этажей чем в оригинальной игре). В подземелье никогда не будет больше 99 этажей. Эта настройка не влияет, если планировка не рандомизирована.

source: Randomize Explorer Rank Unlocks
ja_jp: 探検隊ランクの必要ポイント量をランダム化
ru_ru: Рандомизация разблокировки рангов исследователя

source: If enabled, Explorer Rank Levels are randomly unlocked. The cap for Master Rank unlock is max. 200000 points.
ja_jp: 有効にすると、探検隊ランクの必要ポイント量がランダム化されます。 マスターランクの上限は最大200000ポイントになります。

source: Randomize Explorer Rank Rewards
ja_jp: 探検隊ランク報酬をランダム化
ru_ru: Рандомизация наград за ранги исследователя

source: If enabled, Explorer Ranks give random items as rewards upon unlocking a new level.
ja_jp: 有効にすると、探検隊ランクが上がった時にランダムな道具が報酬として貰えます。
ru_ru: Если включено, то при достижении нового ранга исследователя будут даваться случайные предметы в качестве награды.

source: Only these items will spawn on dungeon floors.
ja_jp: ダンジョンのフロアにはこれらの道具のみがスポーンします。
ru_ru: Только эти предметы будут появляться на этажах подземелья.

source: Controls weight biases when randomizing items. A higher multiplier compared to other categories means that items from that category are more likely to spawn than others. This only applies to the 'Balanced' item algorithm!
ja_jp: 道具をランダム化する際のウェイトバイアスを制御します。 他のカテゴリーと比べて乗数が高いほど、そのカテゴリーの道具は他のカテゴリーよりもスポーンする可能性が高くなります。 ※アルゴリズムを「バランス」に設定した時のみ適用されます
ru_ru: Контролирует смещение веса при рандомизации предметов. Более высокий множитель по сравнению с другими категориями означает, что предметы из этой категории будут появляться с большей вероятностью, чем другие. Это относится только к алгоритму "Сбалансированный"!

source: Tactics & IQ
ja_jp: 作戦 & かしこさ
ru_ru: Тактики и IQ

source: Move Names for "Blind Moves" Mode
ja_jp: Blind Moves モードの技名
ru_ru: Названия приемов для режима "Слепые приемы"

source: A lot of names from the default list are from fantasynamegenerators.com.
ja_jp: デフォルトのリストにある多くの名前は、fantasynamegenerators.com から参照しています。
ru_ru: Многие имена в списке по умолчанию взяты из fantasynamegenerators.com.

source: _Pokémon
ja_jp: ポケモン(_P)
ru_ru: _Покемоны

source: Allowed Pokémon
ja_jp: 許可されたポケモン
ru_ru: Разрешенные покемоны

source: Randomize Starters
ja_jp: 主人公・パートナーをランダム化
ru_ru: Рандомизировать стартовых покемонов

source: Configure which starters are available
ja_jp: 利用可能な主人公・パートナーの設定
ru_ru: Настроить какие стартовые покемоны доступны

source: Randomize NPCs and Bosses
ja_jp: NPC・ボスをランダム化
ru_ru: Рандомизировать NPC и боссов

source: If enabled all NPCs are randomized and all mentions of them in the script. Additionally the following things are also randomized with these new NPCs: Boss fights, Guest Pokémon, Special Episode Player Characters
ja_jp: 有効にすると、すべての NPC がランダム化され、スクリプト中のセリフにも変更された内容が反映されます。 以下のものもランダム化されます。 ・各種ボス ・途中加入ポケモン ・スペシャルエピソードの主人公
ru_ru: Если включено, все NPC и все упоминания о них в сценариях рандомизируются. Кроме того, следующие вещи также рандомизируются с этими новыми NPC: бои с боссами, покемоны-компаньоны, главные герои особых эпизодов

source: Moves
ja_jp: わざ
ru_ru: Приемы

source: Randomize Movesets
ja_jp: レベル習得技をランダム化
ru_ru: Рандомизировать наборы приемов

source: Randomize TMs/HMs
ja_jp: 技マシンの内容をランダム化
ru_ru: Рандомизировать TM/HM

source: If enabled TMs and HMs will contain random moves from the move pool.
ja_jp: 有効にすると、技マシンが技プールから選ばれた内容でランダム化されます。
ru_ru: Если эта функция включена, TM и HM будут содержать случайные приемы из пула приемов.

source: Move Pool
ja_jp: 技プール
ru_ru: Набор приемов

source: "Blind Moves" Mode
ja_jp: Blind Moves モード
ru_ru: Режим "Слепые приемы"

source: Enable "Blind Moves" mode: Move names are replaced with random names and move types are randomized.
ja_jp: Blind Moves モードの有効化: 技の名前はランダムに置き換えられ、タイプはランダムになります。
ru_ru: Включает режим "Слепые приемы": имена приемов заменяются случайными именами, а типы приемов рандомизируются.

source: Configure move names in "Blind Moves" Mode
ja_jp: Blind Moves モードの技名設定
ru_ru: Настройка имен приемов в режиме "Слепые приемы"

source: Additional Pokémon Properties
ja_jp: ポケモンの追加プロパティ
ru_ru: Дополнительные свойства покемонов

source: Randomize Abilities
ja_jp: 特性をランダム化
ru_ru: Рандомизировать способности

source: Configure which abilities are available
ja_jp: 特性の設定
ru_ru: Настроить какие способности доступны

source: Randomize Typings
ja_jp: タイプをランダム化
ru_ru: Рандомизировать типы

source: Tactics &amp; IQ
ja_jp: 作戦 &amp; かしこさ
ru_ru: Тактики &amp; IQ

source: Reset to Default
ja_jp: デフォルトに戻す
ru_ru: Сбросить на значения по умолчанию

source: Select None
ja_jp: 選択を解除
ru_ru: Снять выделение

source: Copy from "Allowed Pokémon"
ja_jp: 「許可されたポケモン」からコピー
ru_ru: Скопировать из списка "Разрешенные покемоны"

source: Copy from Starters
ja_jp: 主人公ポケモンからコピー
ru_ru: Скопировать из Стартовых покемонов

source: Only the Pokémon selected will be used for any randomization option.
ja_jp: ランダム化オプションでは、選択したポケモンのみが使用されます。
ru_ru: Только выбранные покемоны будут использоваться при любом варианте рандомизации.

source: Only the Pokémon selected can appear as random starter options. They also need to be in the list of "Allowed Pokémon".
ja_jp: 選択したポケモンのみがランダムな主人公ポケモンとして表示されます。 また、「許可されたポケモン」のリストに含まれている必要があります。
ru_ru: Только выбранные покемоны могут появиться в качестве случайных стартовых покемонов. Они также должны быть в списке "Разрешенные покемоны".

source: Only the moves selected will be used for any movesets or TM/HM randomization.
ja_jp: 習得技や技マシンのランダム化には、選択した技のみが使用されます。
ru_ru: Только выбранные приемы будут использоваться для любых наборов приемов или рандомизации TM/HM.

source: Randomize Level-Up Movesets
ja_jp: レベル習得技をランダム化
ru_ru: Рандомизировать наборы приёмов при повышении уровня

source: If enabled then what moves Pokémon can learn by level-up is randomized.
ja_jp: 有効にすると、ポケモンがレベルアップによって習得できる技がランダム化されます。
ru_ru: Если включено, то рандомизируются приемы, которые покемон может выучить при повышении уровня.

source: First Move Restrictions
ja_jp: 最初から覚えている技の制限
ru_ru: Ограничения первого приема

source: Must deal damage
ja_jp: 攻撃技必須
ru_ru: Должен наносить урон

source: Must be STAB
ja_jp: タイプ一致必須
ru_ru: Должен быть того же типа, что и покемон

source: Configure additional restrictions for a Pokémon's first move.
ja_jp: ポケモンが最初に覚える技に追加の制限を設定します。
ru_ru: Настройка дополнительных ограничений для первого приема покемона.

source: Randomize TM/HM Movesets
ja_jp: 技マシン習得技をランダム化
ru_ru: Рандомизировать наборы приёмов, изучаемых из TM/HM

source: If enabled then what Pokémon can learn which TMs/HMs is randomized.
ja_jp: 有効にすると、ポケモンが使用できる技マシンと習得できる技がランダム化されます。
ru_ru: Если включено, то рандомизируется, какие покемоны могут выучить какие TM/HM.

source: Dungeon music randomization can be enabled or disabled with the dungeon layout randomization setting.
ja_jp: ダンジョンBGMのランダム化は、ダンジョンレイアウトのランダム化設定で有効または無効にできます。
ru_ru: Рандомизация музыки в подземельях может быть включена или отключена с помощью настройки рандомизации планировки подземелья.

source: Randomize Titlescreen Music
ja_jp: タイトル画面のBGMをランダム化
ru_ru: Рандомизировать музыку главного меню

source: If enabled, the music that plays on the titlescreen is randomized.
ja_jp: 有効にすると、タイトル画面で再生されるBGMがランダム化されます。
ru_ru: Если включено, музыка, воспроизводимая на главном меню, рандомизируется.

source: Randomize Overworld Music
ja_jp: オーバーワールドBGMをランダム化
ru_ru: Рандомизировать музыку мира игры

source: If enabled, the music that plays outside of dungeons is randomized (for the most part).
ja_jp: 有効にすると、ダンジョンの外で再生されるBGMのほとんどがランダム化されます。
ru_ru: Если включено, музыка, играющая вне подземелий, будет рандомизирована (по большей части).

source: Installs the patch '{}' by {}: {}
ja_jp: パッチ '{}' を適用します。 (by {}) {}
ru_ru: Устанавливает патч '{}' от {}: {}

source: Installs patches that allow you to control your team members manually in dungeons. Press Start to toggle. Patch by Cipnit.
ja_jp: ダンジョンでチームメンバーを手動でコントロールできるパッチを適用します。STARTボタンを押すと切り替わります。 作成者: Cipinit
ru_ru: Устанавливает патчи, позволяющие вручную управлять членами команды в подземельях. Нажмите Start, чтобы включить/выключить ручной контроль. Патч от Cipnit.

source: Apply "MoveShortcuts" Patch
ja_jp: "MoveShortcuts" パッチを適用
ru_ru: Применить патч "MoveShortcuts"

source: Apply "UnusedDungeonPatch" Patch
ja_jp: "UnusedDungeonPatch" パッチを適用

source: Apply "Complete Team Control" Patch
ja_jp: "Complete Team Control" パッチを適用
ru_ru: Применить патч "Complete Team Control"

source: Apply "Disarm Monster Houses" Patch
ja_jp: "Disarm Monster Houses" パッチを適用
ru_ru: Применить патч "Disarm Monster Houses"

source: Apply "Fix Memory Softlock" Patch
ja_jp: "Fix Memory Softlock" パッチを適用
ru_ru: Применить патч "Fix Memory Softlock"

source: Personality Quiz Mode
ja_jp: 性格診断モード
ru_ru: Режим теста о личности

source: Default: Ask for Personality
ja_jp: デフォルトの性格診断
ru_ru: По умолчанию: Спросить о личности

source: Ask + Allow Selection
ja_jp: 質問 + 選択を許可
ru_ru: Спросить + разрешить выбор

source: Select Manually
ja_jp: 手動で選択
ru_ru: Выбрать вручную

source: Change the behaviour of the hero starter selection in the personality test, using patches by an anonymous contributor. You can select to have the test for selecting your starter (game default) or have an option to be able to select another starter after that or remove the test entirely. Please note that if you selected any but the default option, you may not be able to remove it again if you randomize the ROM again.
ja_jp: "匿名の投稿者"によるパッチを使用し、性格診断における主人公ポケモン選択処理を変更する必要があります。 主人公ポケモンを選ぶための性格診断を受けるか (ゲームのデフォルト)、その後に別の主人公ポケモンを選ぶか、性格診断を完全に削除するかを選択できます。 デフォルト以外のオプションを選択した場合、ROM を再度ランダム化しても削除できなくなる場合があることに注意してください。
ru_ru: Меняет поведение выбора стартового покемона в тесте на личность, используя патчи от анонима. Вы можете выбрать тест для выбора стартера (по умолчанию) или опцию, позволяющую выбрать другого стартера после этого, или полностью убрать тест. Обратите внимание, что если вы выбрали любую опцию, кроме стандартной, вы не сможете убрать ее снова, если вы снова рандомизируете ROM.

source: Randomize Personality Quiz
ja_jp: 性格診断のランダム化
ru_ru: Рандомизировать тест на личность

source: If enabled, the personality quiz questions will be randomized. You need to define at least two answers, 2-4 answers will be randomly picked.
ja_jp: 有効にすると、性格診断の質問がランダム化されます。 少なくとも2つの回答を定義する必要があります。2〜4個の回答がランダムに選ばれます。
ru_ru: Если эта функция включена, вопросы теста на личность будут рандомизированы. Вам нужно задать как минимум два ответа, 2-4 ответа будут выбраны случайным образом.

source: Include Vanilla Question
ja_jp: 元のゲームの質問を含める
ru_ru: Добавить вопросы из оригинальной игры

source: If enabled, the questions from the base game will also be included in the pool of possible questions.
ja_jp: 有効にすると、元のゲームの質問がプールに含まれます。
ru_ru: Если эта функция включена, вопросы из оригинальной игры также будут включены в список возможных вопросов.

source: Edit Question
ja_jp: 質問を編集
ru_ru: Редактировать вопрос

source: Question
ja_jp: 質問
ru_ru: Вопрос

source: Answers
ja_jp: 回答
ru_ru: Ответы

source: Answer
ja_jp: 回答
ru_ru: Ответ

source: Remove Question
ja_jp: 質問を削除
ru_ru: Удалить вопрос

source: Add Answer
ja_jp: 回答を追加
ru_ru: Добавить ответ

source: Remove Answer
ja_jp: 回答を削除
ru_ru: Удалить ответ

source: Failed to import. Make sure your XML matches the same format as with the export button. Details: {}
ja_jp: インポートに失敗しました。XML がエクスポートボタンに書かれた形式と同じであることを確認してください。 詳細: {}
ru_ru: Не удалось импортировать. Убедитесь, что ваш XML файл имеет тот же формат, что и при использовании кнопки экспортирования. Детали: {}

source: Import questions from XML
ja_jp: XML から質問をインポート
ru_ru: Импортировать вопросы из XML файла

source: Export questions to XML
ja_jp: 質問を XML にエクスポート
ru_ru: Экспортировать вопросы в XML файл

source: Questions
ja_jp: 質問
ru_ru: Вопросы

source: Add question
ja_jp: 質問を追加
ru_ru: Добавить вопрос

source: Failed to load settings: Error while opening file ({}).
ja_jp: 設定の読み込みに失敗しました。 ファイル ({}) を開く際にエラーが発生しました。
ru_ru: Не удалось загрузить настройки: ошибка открытия файла ({}).

source: The config file you tried to import is invalid: {}: {}
ja_jp: インポートしようとした設定ファイルは無効です。 {}: {}
ru_ru: Файл конфигурации, который вы пытались импортировать, неверен: {}: {}

source: Settings loaded!
ja_jp: 設定を読み込みました。
ru_ru: Настройки загружены!

source: Failed to save settings: Error while opening file ({}).
ja_jp: 設定の保存に失敗しました。 ファイルを開く際にエラーが発生しました ({})。
ru_ru: Не удалось сохранить настройки: Ошибка при открытии файла ({}).

source: The path of the settings file needs to end in '.json'.
ja_jp: 設定ファイルのパスは「.json」で終了する必要があります。
ru_ru: Путь к файлу настроек должен заканчиваться на '.json'.

source: Settings saved!
ja_jp: 設定を保存しました。
ru_ru: Настройки сохранены!

source: Backup &amp; Share Randomization Settings
ja_jp: バックアップ &amp; 共有ランダム化設定
ru_ru: Резервное копирование &amp; Поделитесь настройками рандомизации

source: Load from File
ja_jp: ファイルを読み込む
ru_ru: Загрузить из файла

source: Save to File
ja_jp: ファイルへ保存
ru_ru: Сохранить в файл

source: Basic Settings
ja_jp: 基本設定
ru_ru: Основные настройки

source: Randomization Seed
ja_jp: Seed値
ru_ru: Зерно рандомизации

source: Use Native File Handlers
ja_jp: ネイティブファイルハンドラーを使用
ru_ru: Использовать обработчики родных файлов
