Repository: SkyTemple/skytemple-randomizer
Catalog: skytemple_randomizer/data/locale/*/LC_MESSAGES/org.skytemple.Randomizer.po
Languages: ja_jp, ru_ru

source: Invalid XML. '{XML_MOVESET__MOVE_ID}' missing for a level up moveset entry.
ja_jp: XML が無効です。レベル習得技エントリ内に '{XML_MOVESET__MOVE_ID}' が見つかりません。

source: Invalid XML. StatsGrowth must have exactly 100 levels.
ja_jp: XML が無効です。成長率には Lv.100 までのデータが必要です。

source: Invalid XML. '{x}' missing for a stats growth level entry.
ja_jp: XML が無効です。成長率エントリ内に '{x}' が見つかりません。

source: Incompatible XML. The number of portraits don't match with the expected value of {len(value_to_update)}
ja_jp: XML に互換性がありません。顔グラフィックの数が {len(value_to_update)} の期待値と一致しません。
ru_ru: Несовместимый XML. Количество портретов не совпадает с ожидаемым значением {len (value_to_update)}

source: Invalid XML. '{XML_PORTRAITS_PORTRAIT__IMAGE}' missing for a portrait.
ja_jp: XML が無効です。顔グラフィック用の '{XML_PORTRAITS_PORTRAIT__IMAGE}' が見つかりません。

source: Invalid XML. '{XML_PORTRAITS_PORTRAIT__PALETTE}' missing for a portrait.
ja_jp: XML が無効です。ポートレート用の '{XML_PORTRAITS_PORTRAIT__PALETTE}' が見つかりません。

source: Invalid XML. The portrait data of one of the portraits is invalid: {err}
ja_jp: XML が無効です。いずれかのポートレートのポートレートデータが無効です: {err}

source: Healthy
ja_jp: HP80%
ru_ru: Здоров

source: Half Life
ja_jp: HP50%
ru_ru: Ранен

source: Pinch
ja_jp: HP25%
ru_ru: Сильно ранен

source: Level Up
ja_jp: レベルアップ
ru_ru: Повышение уровня

source: Wait
ja_jp: 待機
ru_ru: Ожидание

source: Ground Wait
ja_jp: 待機 (グラウンド)

source: Physical Move
ja_jp: 物理
ru_ru: Физический прием

source: Special Move
ja_jp: 特殊
ru_ru: Особый прием

source: Status Move
ja_jp: 変化
ru_ru: Статусный прием

source: Enemies
ja_jp: 敵
ru_ru: Враги

source: Allies
ja_jp: 味方
ru_ru: Союзники

source: Everyone
ja_jp: 全員
ru_ru: Все

source: User
ja_jp: 自分自身
ru_ru: Пользователь

source: Two-turn move
ja_jp: 2ターン技
ru_ru: Приём в два хода

source: Everyone except user
ja_jp: 自分以外全員
ru_ru: Все, кроме пользователя

source: All allies except user
ja_jp: 自分以外の味方
ru_ru: Все союзники кроме пользователя

source: Invalid
ja_jp: 無効
ru_ru: Недопустимый

source: Special / Invalid
ja_jp: 特殊/無効
ru_ru: Особый / Неверный

source: In front
ja_jp: 正面
ru_ru: Спереди

source: In front + adjacent (like Wide Slash)
ja_jp: 正面3マス (すいへいぎり等)
ru_ru: Спереди + по сторонам (как Широкий Порез)

source: 8 tiles around user
ja_jp: 周囲8マス
ru_ru: 8 плиток вокруг пользователя

source: Room
ja_jp: 部屋全体
ru_ru: Вся комната

source: Two tiles away
ja_jp: 2マス先
ru_ru: На расстоянии двух плиток

source: Straight line
ja_jp: 直線上
ru_ru: Прямая линия

source: Floor
ja_jp: フロア全体
ru_ru: Весь этаж

source: In front; cuts corners
ja_jp: 正面 (角抜け)
ru_ru: Спереди, срезая углы

source: Two tiles away; cuts corners
ja_jp: 2マス先 (角抜け)
ru_ru: На расстоянии двух плиток; срезает углы

source: No condition
ja_jp: 条件なし
ru_ru: Нет условия

source: Based on AI Condition 1 Chance
ja_jp: AI条件1選択率

source: Current HP <= 25%
ja_jp: 現在HPが25%以下
ru_ru: Текущее ОЗ <= 25%

source: Has at least one negative status condition
ja_jp: 悪い状態にかかっている
ru_ru: Имеет как минимум одно негативное состояние

source: Is asleep, in a nightmare or napping
ja_jp: すいみん・あくむ・ねむる状態のいずれか
ru_ru: Спит, видит кошмар или дремлет

source: Is a ghost-type Pokémon and does not have the exposed status
ja_jp: ゴーストタイプのポケモンかつ、みやぶる状態でない

source: Current HP <= 25% or has at least one negative status condition
ja_jp: 現在HPが25%以下、または悪い状態にかかっている
ru_ru: Текущий ОЗ <= 25% или имеет хотя бы одно негативное состояние

source: Floor, Room
ja_jp: 床 (部屋)
ru_ru: Пол, комната

source: Wall, Hallway; Absolute Mover
ja_jp: 壁 (通路) - あくういどう可能
ru_ru: Стена, Коридор, Идеальный Проходчик

source: Wall, Hallway; Impassable
ja_jp: 壁 (通路) - 通行不可
ru_ru: Стена, коридор; непроходимая

source: Wall, Hallway
ja_jp: 壁 (通路)
ru_ru: Стена, коридор

source: Leader Spawn Floor
ja_jp: リーダースポーン地点
ru_ru: Место появления лидера

source: Secondary, Room
ja_jp: 二次地形 (部屋)

source: Chasm, Hallway
ja_jp: 谷 (壁)
ru_ru: Пропасть, коридор

source: Tile type is forced to be "Void / Chasm" (Still rendered as tileset's secondary terrain!).
ja_jp: タイルタイプは強制的に「谷」に設定されます (タイルセットの二次地形としてレンダリングされたままです)。
ru_ru: Тип плитки принудительно установлен на "Пустота / Бездна" (по-прежнему отображается как второстепенный рельеф набора плитки!).

source: Chasm, Hallway; All Chasm
ja_jp: 谷 (壁) - 壁を谷にする

source: Tile type is forced to be "Void / Chasm" (Still rendered as tileset's secondary terrain!). All tiles outside of defined room are made the tileset's defined secondary terrain.
ja_jp: タイルタイプは強制的に「谷」に設定されます (タイルセットの二次地形としてレンダリングされたままです)。部屋の外にあるすべてのタイルは二次地形に置き換えられます。

source: Warp Zone, Room
ja_jp: ワープゾーン (部屋)
ru_ru: Зона телепортации, комната

source: Creates a Warp Zone.
ja_jp: ワープゾーンを作成します。
ru_ru: Создает зону телепортации.

source: Floor, Hallway
ja_jp: 床 (通路)
ru_ru: Пол, коридор

source: Chasm, Hallway; Impassable
ja_jp: 壁 (通路) - 通行不可
ru_ru: Пропасть, коридор; непроходимая

source: Floor, Hallway; Flag 0xA
ja_jp: 床 (通路) - フラグ 0xA
ru_ru: Пол, коридор; флаг 0xA

source: Tile flag 0xA is set to 1 (Unknown what this does).
ja_jp: タイルフラグ 0xA は 1 に設定されています (これがどのように影響するかは不明)。
ru_ru: Флаг 0xA у этой плитки имеет значение 1 (Что это делает - неизвестно).

source: Attendant1 Spawn Floor
ja_jp: 仲間1人目スポーン地点
ru_ru: Зона появления Attendant1

source: Attendant2 Spawn Floor
ja_jp: 仲間2人目スポーン地点
ru_ru: Зона появления Attendant2

source: Attendant3 Spawn Floor
ja_jp: 仲間3人目スポーン地点
ru_ru: Зона появления Attendant3

source: Could not save floor: It contains too much empty data. This probably happened because a lot of spawn lists are empty. Please check the floors you edited and fill them with more data. If you are using the randomizer, check your allowed item list.
ja_jp: フロアを保存できませんでした。空のデータが多すぎます。 このエラーは、多くのスポーンリストが空になっていることが原因と考えられます。 編集したフロアを確認し、データを正しく入力してください。ランダマイザーを使用している場合、許可されているアイテムリストを確認してください。
ru_ru: Не удалось сохранить этаж: он содержит слишком много пустых данных. Вероятно, это произошло потому, что многие списки предметов/врагов пусты. Пожалуйста, проверьте отредактированные этажи и заполните их большим количеством данных. Если вы используете рандомайзер, проверьте список разрешенных предметов.

source: Floor parsing: Unexpected {child.tag}
ja_jp: 床の解析: 予期しない {child.tag}
ru_ru: Анализ этажа: неожиданный {child.tag}

source: Missing {k} for Floor data.
ja_jp: 床データ {k} が存在していません。
ru_ru: Отсутствует {k} в данных этажа.

source: Unexpected sub-node for {XML_FLOOR_LAYOUT}: {child.tag}
ja_jp: 予期しないサブノード: {XML_FLOOR_LAYOUT} {child.tag}

source: {XML_FLOOR_LAYOUT__GENSET} missing for {XML_FLOOR_LAYOUT}.
ja_jp: {XML_FLOOR_LAYOUT__GENSET} が {XML_FLOOR_LAYOUT} に存在していません。
ru_ru: {XML_FLOOR_LAYOUT__GENSET} отсутствует для {XML_FLOOR_LAYOUT}.

source: {XML_FLOOR_LAYOUT__CHANCES} missing for {XML_FLOOR_LAYOUT}.
ja_jp: {XML_FLOOR_LAYOUT__CHANCES} が {XML_FLOOR_LAYOUT} に存在していません。
ru_ru: {XML_FLOOR_LAYOUT__CHANCES} отсутствует для {XML_FLOOR_LAYOUT}.

source: {XML_FLOOR_LAYOUT__TERRAINSET} missing for {XML_FLOOR_LAYOUT}.
ja_jp: {XML_FLOOR_LAYOUT__TERRAINSET} が {XML_FLOOR_LAYOUT} に存在していません。
ru_ru: {XML_FLOOR_LAYOUT__TERRAINSET} отсутствует для {XML_FLOOR_LAYOUT}.

source: {XML_FLOOR_LAYOUT__MISCSET} missing for {XML_FLOOR_LAYOUT}.
ja_jp: {XML_FLOOR_LAYOUT__MISCSET} が {XML_FLOOR_LAYOUT} に存在していません。
ru_ru: {XML_FLOOR_LAYOUT__MISCSET} отсутствует для {XML_FLOOR_LAYOUT}.

source: Invalid structure type {ele.get(XML_FLOOR_LAYOUT__STRUCTURE)}
ja_jp: 構造体タイプの値が無効です {ele.get (XML_FLOOR_LAYOUT__STRUCTURE)}

source: Invalid weather type {ele.get(XML_FLOOR_LAYOUT__WEATHER)}
ja_jp: 天気タイプの値が無効です {ele.get (XML_FLOOR_LAYOUT__WEATHER)}

source: Invalid darkness level type {ele.get(XML_FLOOR_LAYOUT__DARKNESS_LEVEL)}
ja_jp: 暗さレベルの値が無効です {ele.get (XML_FLOOR_LAYOUT__DARKNESS_LEVEL)}

source: Unknown trap {name}.
ja_jp: 不明なトラップ 「{name}」。
ru_ru: Неизвестная ловушка {name}.

source: Trap lists need an entry for all of the 25 traps
ja_jp: 罠リストには 25 個すべての罠に対応するエントリが必要です
ru_ru: В списках ловушек должны быть все 25 ловушек

source: Medium Large
ja_jp: 標準 (大型)
ru_ru: Средне-большой

source: Single Monster House
ja_jp: 大部屋モンスターハウス
ru_ru: Только Засада Монстров

source: Ring
ja_jp: 円状
ru_ru: Кольцо

source: Crossroads
ja_jp: 交差型
ru_ru: Перекресток

source: Two Rooms, One Monster House
ja_jp: 2つの部屋 (片方モンスターハウス)
ru_ru: Две комнаты, одна засада монстров

source: Line
ja_jp: 直線状
ru_ru: Линия

source: Cross
ja_jp: 十字型
ru_ru: Крест

source: Small Medium
ja_jp: 小さいな標準
ru_ru: Малый средний

source: Beetle
ja_jp: 虫型
ru_ru: Жук

source: Outer Rooms
ja_jp: 外周
ru_ru: Комнаты по кругу

source: Medium Large (12)
ja_jp: 標準 (大型) - 12
ru_ru: Средне-большой (12)

source: Medium Large (13)
ja_jp: 標準 (大型) - 13
ru_ru: Средне-большой (13)

source: Medium Large (14)
ja_jp: 標準 (大型) - 14
ru_ru: Средне-большой (14)

source: Medium Large (15)
ja_jp: 標準 (大型) - 15
ru_ru: Средне-большой (15)

source: Clear
ja_jp: はれ
ru_ru: Ясная

source: Sunny
ja_jp: ひざしがつよい
ru_ru: Солнечная

source: Sandstorm
ja_jp: すなあらし
ru_ru: Песчаная буря

source: Cloudy
ja_jp: くもり
ru_ru: Облачная

source: Rainy
ja_jp: あめ
ru_ru: Дождь

source: Hail
ja_jp: あられ
ru_ru: Град

source: Fog
ja_jp: きり
ru_ru: Туман

source: Snow
ja_jp: ゆき
ru_ru: Снег

source: Random
ja_jp: ランダム
ru_ru: Случайная

source: No darkness
ja_jp: 通常
ru_ru: Нет темноты

source: 1-tile vision (Heavy darkness)
ja_jp: 周囲1マス (とても暗い)
ru_ru: Видимость: 1 плитка (Сильная темнота)

source: 2-tile vision (Light darkness)
ja_jp: 周囲2マス (やや暗い)
ru_ru: Видимость: 2 плитки (Легкая темнота)

source: 3-tile vision
ja_jp: 周囲3マス
ru_ru: Видимость: 3 плитки

source: 4-tile vision
ja_jp: 周囲4マス
ru_ru: Видимость: 4 плитки

source: Mud Trap
ja_jp: どろスイッチ
ru_ru: Грязевая ловушка

source: Sticky Trap
ja_jp: くっつきスイッチ
ru_ru: Липкая ловушка

source: Grimy Trap
ja_jp: ベトベタスイッチ
ru_ru: Грязная ловушка

source: Summon Trap
ja_jp: よびよせスイッチ
ru_ru: Призывная ловушка

source: Pitfall Trap
ja_jp: おとしあな
ru_ru: Яма-ловушка

source: Warp Trap
ja_jp: ワープスイッチ
ru_ru: Телепортирующая ловушка

source: Gust Trap
ja_jp: とっぷうスイッチ
ru_ru: Ветряная ловушка

source: Spin Trap
ja_jp: ぐるぐるスイッチ
ru_ru: Кружащая ловушка

source: Slumber Trap
ja_jp: バクスイッチ
ru_ru: Сонная ловушка

source: Slow Trap
ja_jp: ヤドンスイッチ
ru_ru: Замедляющая ловушка

source: Seal Trap
ja_jp: ふういんスイッチ
ru_ru: Запрещающая ловушка

source: Poison Trap
ja_jp: どくばりスイッチ
ru_ru: Ядовитая ловушка

source: Selfdestruct Trap
ja_jp: じばくスイッチ
ru_ru: Подрывная ловушка

source: Explosion Trap
ja_jp: ばくはスイッチ
ru_ru: Взрывная ловушка

source: Pp Zero Trap
ja_jp: わざへりのわな
ru_ru: Ноль-ОС ловушка

source: Chestnut Trap
ja_jp: イガグリスイッチ
ru_ru: Каштановая ловушка

source: Wonder Tile
ja_jp: ふしぎなゆか
ru_ru: Чудо-плитка

source: Pokemon Trap
ja_jp: ポケモンスイッチ
ru_ru: Поке-ловушка

source: Spiked Tile
ja_jp: まきびし
ru_ru: Плитка с шипами

source: Stealth Rock
ja_jp: ステルスロック
ru_ru: Хитрые Скалы

source: Toxic Spikes
ja_jp: どくびし
ru_ru: Токсичные шипы

source: Trip Trap
ja_jp: ころびスイッチ
ru_ru: Скользкая ловушка

source: Random Trap
ja_jp: ゆびふりスイッチ
ru_ru: Случайная ловушка

source: Grudge Trap
ja_jp: おんねんスイッチ
ru_ru: Обидная ловушка

source: Invalid Floor List
ja_jp: 無効なフロアリスト
ru_ru: Недопустимый список этажей

source: References a dungeon floor list that doesn't exist.
ja_jp: 存在しないダンジョンフロアリストを参照します。
ru_ru: Ссылается на несуществующий список этажей подземелья.

source: Invalid Floor
ja_jp: 無効なフロア
ru_ru: Недопустимый этаж

source: References floor that is out of bounds in the floor list for this group.
ja_jp: このグループのフロアリストの範囲外を参照します。
ru_ru: Ссылается на этаж, выходящий за границы списка этажей для этой группы.

source: Re-uses Floor
ja_jp: フロアを再利用
ru_ru: Повторное использование этажа

source: Re-uses floors that are already used by {name}.
ja_jp: 既に {name} で使用されているフロアを再利用します。
ru_ru: Использует этаж, который уже используется в {name}.

source: Unused Floors
ja_jp: 未使用のフロア
ru_ru: Неиспользованные этажи

source: Has {len(self.floors_in_mappa_not_referenced)} extra floors in it's floor list, which are not assigned to any dungeon.
ja_jp: フロアリストに {len (self.floors_in_mappa_not_referenced)} 個の追加フロアがありますが、どのダンジョンにも割り当てられていません。
ru_ru: Имеет {len(self.floors_in_mappa_not_referenced)} этажей в списке этажей, которые не относятся к какому-либо подземелью.

source: Can not import map background: Width of both images must match the current map width: {expected_width}px
ja_jp: 背景をインポートできません。両方の画像の幅は現在のマップの幅({expected_width}px)と一致する必要があります。

source: Can not import map background: Height of both images must match the current map height: {expected_height}px
ja_jp: 背景をインポートできません。両方の画像の高さは現在のマップの高さ({expected_height}px)と一致する必要があります。

source: The dimensions of all images must be the same.
ja_jp: すべての画像のサイズは同じである必要があります。
ru_ru: Размеры всех изображений должны быть одинаковыми.

source: Cannot convert PIL image to CHR: Must be indexed image (=using a palette)
ja_jp: PIL イメージを CHR ファイルに変換できません。パレットを使用したインデックス付きの画像である必要があります。

source: Cannot convert PIL image to CHR: width and height must be a multiple of {CHR_TILE_WIDTH}
ja_jp: PIL イメージを CHR ファイルに変換できません。幅と高さは {CHR_TILE_WIDTH} の倍数である必要があります。

source: Can not import map background: Width of image must match the expected width: {expected_width}px
ja_jp: マップ背景をインポートできません。画像の幅は{expected_width}pxである必要があります。

source: Can not import map background: Height of image must match the expected height: {expected_height}px
ja_jp: マップ背景をインポートできません。画像の高さは{expected_height}pxである必要があります。

source: A dungeon background or tilemap can not have more than 400 chunks.
ja_jp: ダンジョンの背景やタイルマップには、400を超えるチャンクを含めることはできません。

source: This palette has no animation.
ja_jp: このパレットにはアニメーションがありません。
ru_ru: Эта палитра не имеет анимации.

source: This must be a color indexed image!
ja_jp: カラーインデックス付きの画像である必要があります。

source: Font parsing: Unexpected {child.tag}
ja_jp: フォント解析: 予期しない {child.tag}
ru_ru: Анализ шрифта: неожиданный {child.tag}

source: Character {e.char} in table {e.table} is defined multiple times in a font file!
ja_jp: テーブル {e.table} の文字 {e.char} がフォントファイル内で複数回定義されています。
ru_ru: Символ {e.char} в таблице {e.table} определен в файле шрифта несколько раз!

source: Character {e.char} in table {e.table} is be defined multiple times in a font file!
ja_jp: テーブル {e.table} の文字 {e.char} がフォントファイル内で複数回定義されています。

source: Could not load KAO at {old_index},{old_subindex}: {ex}
ja_jp: {old_index},{old_subindex}: {ex} で KAO をロードできませんでした
ru_ru: Не удалось загрузить KAO из {old_index},{old_subindex}: {ex}

source: Can not convert PIL image to Kao: Image dimensions must be {img_dim}x{img_dim}px.
ja_jp: PILイメージをKaoファイルに変換できません。画像のサイズは {img_dim}x{img_dim}pxである必要があります。

source: This portrait does not compress well, the result size is greater than 800 bytes ({len(new_img_compressed)} bytes total). If you haven't done already, try applying the 'ProvideATUPXSupport' to install an optimized compression algorithm, which might be able to better compress this image.
ja_jp: この顔グラフィックは圧縮されておらず、結果のサイズが 800 バイト ({len(new_img_compressed)} バイト合計) を超えています。 最適化された圧縮アルゴリズム「ProvideATUPXSupport」を適用することで、より適切に圧縮できる可能性があります。

source: Portrait has an invalid size of {img.size}, Not divisble by {PORTRAIT_SIZE}x{PORTRAIT_SIZE}
ja_jp: 顔グラフィックのサイズが無効です。 {img.size}で割り切ることができません。 {PORTRAIT_SIZE}x{PORTRAIT_SIZE}
ru_ru: Портрет имеет недопустимый размер {img.size}, не делящийся на {PORTRAIT_SIZE}x{PORTRAIT_SIZE}

source: Portrait has an invalid size of {img.size}, exceeding max of {max_size}
ja_jp: 顔グラフィックサイズ {img.size} は無効です。最大サイズ {max_size} を超過しています。
ru_ru: Портрет имеет недопустимый размер {img.size}, превышающий максимальный размер {max_size}

source: Semi-transparent pixels found at: {rogue_pixels}
ja_jp: 半透明のピクセルが見つかりました: {rogue_pixels}
ru_ru: Найдены полупрозрачные пиксели: {rogue_pixels}

source: The following emotions have transparent pixels: {rogue_tiles}
ja_jp: 以下の顔グラフィックには透明のピクセルがあります。: {rogue_tiles}
ru_ru: Следующие эмоции имеет прозрачные пиксели: {rogue_tiles}

source: File should have original and flipped versions of emotions: {str(flipped_tiles)}
ja_jp: ファイルにはオリジナルと反転した顔グラフィックが必要です。: {str (flipped_tiles)}

source: Palette Only
ja_jp: パレットのみ
ru_ru: Только палитра

source: 2 bits per pixel (4 colors)
ja_jp: 1pxあたり2ビット (4色)
ru_ru: 2 бита на пиксель (4 цвета)

source: 4 bits per pixel (16 colors)
ja_jp: 1pxあたり4ビット (16色)
ru_ru: 4 бита на пиксель (16 цвета)

source: 8 bits per pixel (256 colors)
ja_jp: 1pxあたり8ビット (256色)
ru_ru: 8 бит на пиксель (256 цвета)

source: Can not convert PIL image to WTE: Must be indexed image (=using a palette)
ja_jp: PILイメージをWTEファイルに変換できません。パレットを使用したインデックス付きの画像である必要があります。

source: This image is too big to fit into a WTE file.
ja_jp: この画像は大きすぎるため、WTEファイルに収まりません。

source: Semi-Opaque
ja_jp: 半透明
ru_ru: Полупрозрачный

source: Transparent
ja_jp: 透明
ru_ru: Прозрачный

source: Opaque
ja_jp: 不透明
ru_ru: Непрозрачный

source: Tile and masks list must have exactly 3 items
ja_jp: タイルとマスクのリストは、必ず3つの項目を持つ必要があります。

source: Can not convert PIL image to ZMAPPAT: Must be indexed images (=using a palette)
ja_jp: PILイメージをWTEファイルに変換できません。パレットを使用したインデックス付きの画像である必要があります。

source: The image must have dimensions {IMG_WIDTH}x{IMG_HEIGHT}.
ja_jp: 画像サイズは {IMG_WIDTH}x{IMG_HEIGHT} に設定する必要があります。
ru_ru: Изображение должно иметь размеры {IMG_WIDTH}x{IMG_HEIGHT}.

source: This image must be compressed better to fit in the arm9 ({len(data)} > {block.end-block.address}).
ja_jp: この画像は arm9 ({len (data)} > {block.end-block.address}) に収まるように圧縮する必要があります。
ru_ru: Это изображение должно быть лучше сжато, чтобы поместиться в arm9 ({len(data)} > {block.end-block.address}).

source: White
ja_jp: 白
ru_ru: Белый

source: Black
ja_jp: 黒
ru_ru: Чёрный

source: Red
ja_jp: 赤
ru_ru: Красный

source: Blue
ja_jp: 青
ru_ru: Синий

source: Green
ja_jp: 緑
ru_ru: Зеленый

source: Yellow
ja_jp: 黄色
ru_ru: Желтый

source: Orange
ja_jp: オレンジ
ru_ru: Оранжевый

source: Purple
ja_jp: 紫
ru_ru: Фиолетовый

source: Pink
ja_jp: ピンク
ru_ru: Розовый

source: Leaves
ja_jp: 木の葉
ru_ru: Листья

source: Snowflakes
ja_jp: 吹雪
ru_ru: Снежинки

source: Flames
ja_jp: 火炎
ru_ru: Огни

source: Sand
ja_jp: 砂嵐
ru_ru: Песок

source: Bubbles
ja_jp: 泡
ru_ru: Пузыри

source: Earthquake
ja_jp: じしん
ru_ru: Землетрясение

source: Sleep
ja_jp: すいみん
ru_ru: Сон

source: Speed -1
ja_jp: 移動速度 -1
ru_ru: Скорость -1

source: Attack -1
ja_jp: 攻撃 -1
ru_ru: Атака -1

source: Accuracy -1
ja_jp: 命中 -1
ru_ru: Точность -1

source: Cringe
ja_jp: ひるみ
ru_ru: Съеживание

source: Freeze
ja_jp: こおり
ru_ru: Заморозка

source: Paralysis
ja_jp: まひ
ru_ru: Паралич

source: Rock Slide
ja_jp: いわなだれ
ru_ru: Камнепад

source: Tri Attack
ja_jp: トライアタック
ru_ru: Три-Атака

source: Hydro Pump
ja_jp: ハイドロポンプ
ru_ru: Гидронасос

source: Blizzard
ja_jp: ふぶき
ru_ru: Метель

source: Ice Beam
ja_jp: れいとうビーム
ru_ru: Луч льда

source: Seed Bomb
ja_jp: タネばくだん
ru_ru: Семя-Бомба

source: Mud Bomb
ja_jp: どろばくだん
ru_ru: Грязевая бомба

source: Foggy 1
ja_jp: もや 1
ru_ru: Туманная 1

source: Foggy 2
ja_jp: もや 2
ru_ru: Туманная 2

source: Foggy 3
ja_jp: もや 3
ru_ru: Туманная 3

source: Foggy 4
ja_jp: もや 4
ru_ru: Туманная 4

source: Foggy 5
ja_jp: もや 5
ru_ru: Туманная 5

source: Foggy 6
ja_jp: もや 6
ru_ru: Туманная 6

source: Normal Enemy
ja_jp: 通常の敵
ru_ru: Обычный враг

source: Outlaw
ja_jp: おたずねもの
ru_ru: Преступник

source: Outlaw Enemy
ja_jp: おたずねもの (潜伏)
ru_ru: Враг-преступник

source: Outlaw Running Away
ja_jp: おたずねもの (逃走)
ru_ru: Убегающий преступник

source: Rival Team Leader
ja_jp: 相手のチームリーダー
ru_ru: Лидер команды противника

source: Rival Team Member
ja_jp: 相手のチームメンバー
ru_ru: Член команды противника

source: Strong Enemy
ja_jp: ボス敵
ru_ru: Сильный враг

source: Waiting for Rescue Ally
ja_jp: 救助待ち中のポケモン
ru_ru: Союзник, ожидающий спасения

source: Helping Ally
ja_jp: 救助対象のポケモン
ru_ru: Союзник

source: Other Game Team Leader
ja_jp: たんけんたいのまのリーダー

source: Other Game Team Member 2
ja_jp: たんけんたいのまのメンバー 2

source: Other Game Team Member 3
ja_jp: たんけんたいのまのメンバー 3

source: Other Game Team Member 4
ja_jp: たんけんたいのまのメンバー 4

source: Unknown 5
ja_jp: 不明 5
ru_ru: Неизвестно 5

source: Bazaar Host
ja_jp: ひみつのバザー (主催/キルリア)

source: Bazaar Healer
ja_jp: ひみつのバザー (回復/マネネ)

source: Bazaar Surprise
ja_jp: ひみつのバザー (福袋/マルノーム)

source: Bazaar Clean Sticky Items
ja_jp: ひみつのバザー (洗浄/ベロベルト)

source: Bazaar Escape
ja_jp: ひみつのバザー (脱出/ヌケニン)

source: '{guest1_index}' is not a valid guest pokémon index
ja_jp: '{guest1_index}' は有効なゲストポケモンのインデックスではありません。

source: '{guest2_index}' is not a valid guest pokémon index
ja_jp: '{guest2_index}' は有効なゲストポケモンのインデックスではありません。

source: Game Main Menu
ja_jp: トップメニュー (メイン)

source: Game Sub Menu
ja_jp: トップメニュー (サブ)

source: Continue Choice
ja_jp: つづきからの選択

source: Main Debug Menu
ja_jp: デバッグメニュー (メイン)

source: Quiz Debug Menu
ja_jp: みはりばんデバッグメニュー

source: Footprint Debug Menu
ja_jp: みはりばん結果デバッグメニュー

source: Bank Main Menu
ja_jp: ヨマワルぎんこうメインメニュー

source: Evolution Menu Confirm
ja_jp: 進化メニュー (確認)

source: Evolution Sub Menu
ja_jp: 進化メニュー (サブ)

source: Evolution Main Menu
ja_jp: 進化メニュー (メイン)

source: Assembly Menu Confirm
ja_jp: チリーンへんせいじょメニュー (確認)

source: Assembly Main Menu
ja_jp: チリーンへんせいじょメニュー (メイン)

source: Assembly Sub Menu
ja_jp: チリーンへんせいじょメニュー (サブ)

source: Moves Menu Confirm
ja_jp: 技メニュー (確認)

source: Moves Sub Menu
ja_jp: 技メニュー (サブ)

source: Moves Main Menu
ja_jp: 技メニュー (メイン)

source: Bar Menu Confirm
ja_jp: パッチールのドリンクスタンドメニュー (確認)

source: Bar Main Menu
ja_jp: パッチールのドリンクスタンドメニュー (メイン)

source: Bar Sub Menu
ja_jp: パッチールのドリンクスタンドメニュー (サブ)

source: Recycle Menu Confirm
ja_jp: たんけんリサイクルメニュー (確認)

source: Recycle Sub Menu
ja_jp: たんけんリサイクルメニュー (サブ)

source: Recycle Main Menu
ja_jp: たんけんリサイクルメニュー (メイン)

source: Synthesis Menu Confirm
ja_jp: グレッグルのトレードてんメニュー (確認)

source: Synthesis Sub Menu
ja_jp: グレッグルのトレードてんメニュー (サブ)

source: Synthesis Main Menu
ja_jp: グレッグルのトレードてんメニュー (メイン)

source: Shop Menu Confirm
ja_jp: カクレオンしょうてんメニュー (確認)

source: Shop Main Menu
ja_jp: カクレオンしょうてんメニュー (メイン)

source: Storage Menu Confirm
ja_jp: ガルーラのそうこメニュー (確認)

source: Storage Main Menu
ja_jp: ガルーラのそうこメニュー (メイン)

source: Hatcher Menu Confirm
ja_jp: おせわやラッキーメニュー (確認)

source: Hatcher Main Menu
ja_jp: おせわやラッキーメニュー (メイン)

source: Appraiser Menu Confirm
ja_jp: ネイティオかんていじょメニュー (確認)

source: Appraiser Main Menu
ja_jp: ネイティオかんていじょメニュー (メイン)

source: Appraiser Sub Menu
ja_jp: ネイティオかんていじょメニュー (サブ)

source: Discard Items Menu Confirm
ja_jp: 道具がいっぱいの時のメニュー (確認)

source: Discard Items Sub Menu
ja_jp: 道具がいっぱいの時のメニュー (サブ)

source: Discard Items Main Menu
ja_jp: 道具がいっぱいの時のメニュー (メイン)

source: Dungeon Main Menu
ja_jp: ダンジョンメニュー (メイン)

source: Dungeon Sub Menu
ja_jp: ダンジョンメニュー (サブ)

source: Start Menu Confirm
ja_jp: ゲーム開始時のメニュー (確認)

source: Dungeon Debug Menu
ja_jp: ダンジョンデバッグメニュー

source: This menu must have {num_entries} entries!
ja_jp: このメニューには {num_entries} エントリが必要です。
ru_ru: Это меню должно иметь {num_entries} записей!

source: Standing Animation (loop)
ja_jp: 立ちアニメーション(ループ)

source: Standing Animation (1st frame)
ja_jp: 立ちアニメーション(1フレーム目)

source: Walking Animation (1st frame)
ja_jp: 歩きアニメーション(1フレーム目)
ru_ru: Анимация ходьбы (1-й кадр)

source: Error while applying the patch: {ex}
ja_jp: パッチ適用エラー: {ex}
ru_ru: Ошибка при применении патча: {ex}

source: Improvements and Tweaks
ja_jp: 改善と調整
ru_ru: Улучшения и исправления

source: New Mechanics
ja_jp: 新しい仕組み
ru_ru: Новые механики

source: Bugfixes
ja_jp: バグ修正
ru_ru: Исправления ошибок

source: Utility
ja_jp: ユーティリティ
ru_ru: Утилиты

source: Others
ja_jp: その他
ru_ru: Прочее

source: Tells the game to load the actor and level lists from separate files. Extracts both files on applying the patch.
ja_jp: アクターとレベルのリストを別々のファイルからロードするように変更します。 パッチ適用時に両方のファイルを抽出します。
ru_ru: Указывает игре загружать списки актеров и уровней из отдельных файлов. Распаковывает оба файла при применении патча.

source: This patch can not be re-applied.
ja_jp: このパッチは再適用できません。
ru_ru: Этот патч не может быть применен повторно.

source: The source data specification was not found in the configuration.
ja_jp: ソースデータの仕様が構成に見つかりません。
